[
  {
    "source": "The Hindu",
    "title": "Telangana receives 44 fire calls on Deepavali, no major incidents linked to crackers",
    "description": "",
    "url": "https://www.thehindu.com/news/national/telangana/telangana-receives-44-fire-calls-on-deepavali-no-major-incidents-linked-to-crackers/article70185667.ece",
    "published_date": "2025-10-21T10:43:23",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "The Telangana State Disaster Response and Fire Services Department received 44 fire calls across the State onDeepavali day,including 18 within the limits of the Greater Hyderabad Municipal Corporation GHMC. Officials from the Fire Control Room said that of the total, 38 were categorised as small fires, three as medium, and one as serious. The medium fire calls were reported from Chandulal Baradari, Yakutpura, and Mahabubabad, while the serious call came from an industrial unit in Sangareddy. Preliminary findings suggest that the Sangareddy fire was caused by a short circuit and not linked to fireworks. No major fire incidents related to crackers were reported this year, an official from the fire control room confirmed. In comparison, the department had received 33 fire calls during Deepavali in 2024, all related to crackers, including three major mishaps. One such incident occurred on Street Number 18 in Himayat Nagar, where a third-floor flat was gutted. While property damage was significant, no serious injuries were reported in any of the incidents, officials added. Published- October 21, 2025 04:13 pm IST disaster, accident and emergency incidentfireTelanganaHyderabaddisaster",
    "extracted_at": "2025-10-21T16:52:12.036693",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 180,
    "is_cleaned": true
  },
  {
    "source": "The Hindu",
    "title": "Flash floods inundate houses, shop at Cherupuzha as heavy rains batter hilly areas of Kannur in Kerala",
    "description": "Local residents said water levels rose rapidly following hours of intense rainfall in upper catchment areas",
    "url": "https://www.thehindu.com/news/national/kerala/flash-floods-inundate-houses-shop-at-cherupuzha-as-heavy-rains-batter-hilly-areas-of-kannur-in-kerala/article70185809.ece",
    "published_date": "2025-10-21T09:53:45",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Continuous heavy rain in the hilly regions of Kannur, Kerala, triggered flash floods in Cherupuzha on Monday night, inundating two houses and a business establishment. At Prappoil, a compound wall collapsed onto a nearby house, though no casualties were reported. Local residents said water levels rose rapidly following hours of intense rainfall in the upper catchment areas. Heavy rain continues to lash several parts of Kerala. The Indian Meteorological Department IMD has issued an orange alert for Idukki, Ernakulam, Malappuram and Kozhikode districts on Tuesday, indicating the likelihood of very heavy rainfall. A yellow alert is in place for Thiruvanathapuram, Kollam, Pathanamthitta, Alapuzha, Kottayam, Thrissur, Palakkad, Wayanad, Kannur and Kasaragod districts. Authorities have urged residents in landslide-prone and low-lying areas to remain vigilant as the rain is expected to continue for the next few days. Published- October 21, 2025 03:23 pm IST natural disasterdisasterdisaster, accident and emergency incidentfloodweatherrainsKerala",
    "extracted_at": "2025-10-21T16:52:14.653281",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 148,
    "is_cleaned": true
  },
  {
    "source": "The Hindu",
    "title": "K-Rail route likely to be revised, says CPIM Kerala secretary M.V. Govindan",
    "description": "Govindan says a new approach is necessary since the Centre has not yet approved the existing proposal",
    "url": "https://www.thehindu.com/news/national/kerala/k-rail-route-likely-to-be-revised-says-cpim-kerala-secretary-mv-govindan/article70185697.ece",
    "published_date": "2025-10-21T09:17:05",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "The Communist Party of India CPIM is considering changes to the K-Rail project, with plans to shift it to a new route, party Kerala State secretary M.V. Govindan has said. Speaking to the media at Taliparamba in Kannur on Tuesday, he clarified that a new approach was necessary since the Centre had not yet approved the existing proposal. Mr. Govindan said that financial constraints were not an issue and that the only hurdle was the lack of Central approval. He described K-Rail as one of Keralas most important development projects in the last 50 years. His remarks come in support of the proposal submitted to the Railways last March by technocrat E. Sreedharan. Mr. Sreedharan had stated that the alternative plan was more practical than the original K-Rail alignment and would not affect local residents. The alternative is more useful than K-Rail. There will be no problem for the locals, but the Central overnment must give permission, he told the media in March. Published- October 21, 2025 02:47 pm IST products and serviceseconomy, business and financerailway transporttransportpolitics and governmentKeralaKannurinfrastructure projectsconstruction and property",
    "extracted_at": "2025-10-21T16:52:16.303868",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 182,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "Prashant Kishor claims 3 party candidates 'forced' to withdraw Bihar nomination",
    "description": "Poll strategist-turned-politician Prashant Kishor on Tuesday levelled a big allegation against the ruling NDA in Bihar. Kishor said that three candidates of his Jan Suraaj Party had to withdraw their",
    "url": "https://www.hindustantimes.com/india-news/prashant-kishor-jan-suraaj-candidates-forced-to-withdraw-bihar-nomination-pressure-intimidation-bjp-101761045103621.html",
    "published_date": "2025-10-21T16:52:24.763615",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "Poll strategist-turned-politician Prashant Kishor on Tuesday levelled a big allegation against the ruling NDA in Bihar. Kishor said that three candidates of his Jan Suraaj Party had to withdraw their nomination and accused the BJP of trying to \"create an atmosphere that we're scared\". The BJP is part of the ruling NDA coalition, apart from Chief Minister Nitish Kumar's Janata Dal United. With just weeks left for the Assembly elections in Bihar, Prashant Kishor made the big claim during a press conference in Patna. \"The election process has begun, and if anyone is feeling the most threatened, it's the NDA's BJP. They're using the mahagathbandhan to scare the public, saying, 'Vote for us, or Lalu's jungle raj will return'. In the past four to five days, three declared Jan Suraaj candidates who filed their nominations were forced to withdraw their nominations,\" Kishor said. Taking a dig at the BJP, Prashant Kishor also said that the party \"has developed a reputation\" of forming the government in Bihar regardless of which party wins.",
    "extracted_at": "2025-10-21T16:52:24.763615",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 171,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "Aurangzeb, Akbar admirers: Delhi govt says pollution not linked to Diwali",
    "description": "The Delhi government on Tuesday dismissed claims that Diwali fireworks led to thecitys pollution, accusing those making the link of being admirers of Aurangzeb and Akbar with vested interests. Lash",
    "url": "https://www.hindustantimes.com/india-news/aurangzeb-akbar-admirers-delhi-environment-minister-says-pollution-aqi-not-linked-to-diwali-slams-aap-101761042887699.html",
    "published_date": "2025-10-21T16:52:26.054863",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "The Delhi government on Tuesday dismissed claims that Diwali fireworks led to thecitys pollution, accusing those making the link of being admirers of Aurangzeb and Akbar with vested interests. Lashing out at AAP for crticising the Delhi government's handling of pollution in the national capital, Delhi's environment minister Manjinder Singh Sirsa said that the party was deliberately bringing Diwali, Sanatana Dharma, and Hinduism into the picture. \"This isn't the BJP's festival. It's a Sanatan Hindu festival, and why are you cursing the festival? Why are you using words against the festival? But to say that BJP is celebrating Diwali, to say that BJP is bursting crackers like this, to say that BJP is doing such wrong things, I feel very embarrassed,\" Sirsa said. He also accused former Delhi Chief Minister Arvind Kejriwal ofbanning firecrackers in the cityduring the AAP regime to \"garner the votes of a particular community\". \"Since this morning, Arvind Kejriwal's entire team has been constantly cursing Diwali. Sanjay Singh and his colleagues have been tweeting since last night, asking to stop celebrating Diwali. Aam Aadmi Party president is cursing the BJP,\" Sirsa said. He later lashed out at claims linkingDiwali celebrations to the rise in pollution levelsin the city and said: \"Those who are blaming Diwali for this, it is a lie. This is being done only to please some section. The admirers of Aurangzeb and Akbar are saying this; those who had put Tipu Sultan's photo in the Vidhan Sabha are saying this.\" The Environment Minister also noted that this years post-Diwali rise in pollution levels in Delhi was significantly lower compared to previous years. Presenting data during a press conference, Sirsa said that the difference between the Air Quality Index AQI recorded before and after Diwali was only 11 points, and asked: \"Will you hold Diwali responsible for this? Will you hold the faith of all the Sanatanis and Hindus in Delhi accountable? What is the fault in",
    "extracted_at": "2025-10-21T16:52:26.054863",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 323,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "When clouds will come: Why Delhi minister ruled out artificial rain in city",
    "description": "As Delhi faces 'very poor' air quality a day after Diwali, Delhi Environment Minister Manjinder Singh Sirsa shared an update on the Rekha Gupta-led BJP government's plan for artificial rain through cl",
    "url": "https://www.hindustantimes.com/india-news/when-the-clouds-will-come-why-delhi-minister-ruled-out-artificial-rain-amid-very-poor-aqi-101761041438544.html",
    "published_date": "2025-10-21T16:52:29.966411",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "As Delhi faces 'very poor' air quality a day after Diwali, Delhi Environment Minister Manjinder Singh Sirsa shared an update on the Rekha Gupta-led BJP government's plan for artificial rain through cloud seeding, a long-awaited proposal to mitigate the annual air pollution crisis during approaching winters. While addressing a briefing on Tuesday, Sirsa ruled out an immediate plan for cloud seeding, saying the seeding will only be possible \"when there are clouds\". Also Read:Delhis air in shambles, Supreme Court chose crackers over right to live: Amitabh Kant \"For those asking us, why are we not getting cloud seeding done. I want to tell these illiterate people, they are burning in vengeance and forget everything. In cloud seeding, the cloud comes first and then comes the seeding,\" the minister said in the briefing. \"So, when the clouds will come, then there will be seeding. The day there are clouds, then there will be seeding done and there will be rain as well,\" he added. Delhi on Tuesday woke to a thick and toxic haze as the air pollution levels soared over 300, several times than number recommended by World Health Organization. Also Read:Delhi ready for cloud seeding, awaits IMDs green signal: Sirsa However, the minister, while speaking of very poor AQI, said that the air quality index in Delhi before Diwali was 341 and it rose to 356 after festival, just 11 points up. The remarks of the environment minister came even as 29 out of 31 stations in Delhi were in red, indicating very poor AQI. The highest AQI was recorded in Bawana at 429 severe, according to the government data available on SAMEER app. The pollution spiked in the national capital this week due to a host of reasons: bursting of Diwali crackers, poor meteorological conditions, stubble burning in parts of neighbouring states and vehicular emissions.",
    "extracted_at": "2025-10-21T16:52:29.966411",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 307,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "Rain lashes TN, red alert issued in 8 districts; CM reviews situation",
    "description": "Chennai, As the Northeast monsoon intensified across Tamil Nadu, the regional weather office on Tuesday issued heavy rainfall alert to a number of districts, while Chief Minister M K Stalin reviewed t",
    "url": "https://www.hindustantimes.com/india-news/rain-lashes-tn-red-alert-issued-in-8-districts-cm-reviews-situation-101761041776161.html",
    "published_date": "2025-10-21T16:52:31.307376",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "Chennai, As the Northeast monsoon intensified across Tamil Nadu, the regional weather office on Tuesday issued heavy rainfall alert to a number of districts, while Chief Minister M K Stalin reviewed the situation with officials and directed that precautionary measures be put in place in view of the downpour. A 'red' alert was issued for 8 districts and an orange alert for Chennai for Tuesday, even as widespread rains lashed various parts of the state, according to the Met department. Stalin reviewed precautionary measures being undertaken in the city and its surrounding districts and the Cauvery delta districts that have been witnessing steady downpour. A red alert was issued to Villupuram, Cuddalore, Mayiladuthurai, Nagapattinam, Tiruvallur, Thanjavur, Pudukottai and Ramanathapuram, an official from the Regional Meteorological Centre said. Similar alert was sounded for neighbouring Puducherry union territory as well. \"Heavy rain is likely in the entire north coastal belt, but extremely heavy rain is expected in the above districts,\" the official said. According to him, an orange alert has been sounded for Chennai, Tiruvallur, Chengalpattu, Kancheepuram, Kallakurichi, Ariyalur, Perambalur, Thoothukudi, Tirunelveli and Kanyakumari. A red alert indicates extremely heavy rain of over 20 cm in 24 hours, while an orange alert means very heavy rain of 11 cm to 20 cm. In Chennai, CM Stalin held a meeting with district collectors through video conference and instructed them to keep relief camps ready for people affected by rain. All arrangements should be made for people, including food, drinking water and medicine, he said, according to an official release. To mitigate damage caused by rain, the CM advised the teams to be ready with necessary equipment like JCB machines, boats, motor pumps, trucks and saws.",
    "extracted_at": "2025-10-21T16:52:31.307376",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 282,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "Continued unhygienic state of washrooms violation of fundamental rights of court users, SC told",
    "description": "New Delhi, The continued unhygienic state of washrooms in court complexes across the country constitutes a persistent violation of the fundamental rights and the right to dignity of all users, includi",
    "url": "https://www.hindustantimes.com/india-news/continued-unhygienic-state-of-washrooms-violation-of-fundamental-rights-of-court-users-sc-told-101761040616001.html",
    "published_date": "2025-10-21T16:52:32.622330",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "New Delhi, The continued unhygienic state of washrooms in court complexes across the country constitutes a persistent violation of the fundamental rights and the right to dignity of all users, including judges, advocates, litigants and staff, according to a status report filed on behalf of different high courts before the Supreme Court. The apex court was informed that the poor condition of washrooms, even in the high courts in metropolitan cities, is not an isolated incident but shows a systemic and administrative failure in allocating funds, enforcing maintenance contracts and ensuring accountability. \"The existing infrastructure fails to meet the standards of a modern and inclusive public utility; it directly implicates the failure to ensure public health and sanitation. \"The absence of facilities for Persons with Disabilities in major high courts and district courts constitutes a violation of their right to equality and non-discrimination, mandated by the Rights of Persons with Disabilities Act; this lack includes non-compliant construction, absence of ramps, support bars, and appropriate turning for wheelchairs,\" the status report said. The top court was told that the failure of most courts to provide separate and gender neutralinclusive washrooms for the third gender disregards the fundamental rights and dignity. \"The lack of functional crèchechildcare facilities negatively impacts the right to practice a profession for female advocates and staff who are mothers, creating a barrier to gender equality in the legal profession. \"The situation is most critical in the subordinate judiciary, reflecting a profound infrastructure inequity. There is a need for micro-level development. What is required is decentralised implementation, focusing on local needs assessment, specific budget allocation, and community-level oversight to ensure functional water supply, plumbing, and daily cleaning contracts for every single court complex,\" the status report said. The apex cou",
    "extracted_at": "2025-10-21T16:52:32.622330",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 291,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "Bihar Election 2025 Live Updates: Congress, RJD failed to uphold coalition dharma, JMM says wont contest Bihar polls",
    "description": "Bihar Assembly Election 2025 Live Updates: Jharkhands ruling party blamed the RJD and Congress of not including it in seat-sharing talks, Bihar Assembly Election 2025 Live Updates: Last week, Prashant Kishor's Jan Suraaj Party announced its second list of candidates, for 65 constituencies, taking the total number of declared nominees to 116 out of the states 243 seats.",
    "url": "https://indianexpress.com/article/india/bihar-assembly-election-2025-live-updates-prashant-kishor-alleges-3-candidates-of-his-jan-suraaj-party-withdrew-nomination-under-pressure-from-bjp-10318419/",
    "published_date": "2025-10-21T16:24:40+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Bihar Assembly Election 2025 Live Updates: Prashant Kishor alleges 3 candidates of his Jan Suraaj Party withdrew nomination under pressure from BJP Bihar Assembly Election 2025 Live Updates: Last week, Prashant Kishor's Jan Suraaj Party announced its second list of candidates, for 65 constituencies, taking the total number of declared nominees to 116 out of the states 243 seats. _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit By: Express Web Deskhttps:indianexpress.comagencyexpress-web-desk Updated: October 21, 2025 04:24 PM IST Bihar Assembly Election 2025 Live Updates: Addressing a press conference on Tuesday, Prashant Kishor alleged that three candidates of his Jan Suraaj Party in Bihar polls withdrew nomination under pressure from the ruling coalitions Bharatiya Janata Party BJP. Kishor urged Election Commission to ensure security of candidates in the poll-bound state. Last week his party announced its second list of candidates, for 65 constituencies, taking the total number of declared nominees to 116 out of the states 243 seats. The Jharkhand Mukti Morchahttps:indianexpress.comaboutjharkhand-mukti-morcha JMM has announced that the party will not contest the upcoming Assembly elections in Bihar, accusing INDIA bloc allies Congress and RJD of failing to uphold coalition dharma. JMM leader Sudeep Kumar Sonu made the announcement at a press conference in Jharkhands Giridih. This comes just two days after JMM general secretary Supriyo Bhattacharya said on Saturday that the party would contest si",
    "extracted_at": "2025-10-21T16:52:38.297807",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 225,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "Truth is not what they showed: Akhilesh Yadav, AAP target BJP after Ayodhya Deepotsav record  India News - The Indian Express",
    "description": "Two new world records were set at this year's Deepotsav in Ayodhya: one, for the largest display of oil lamps, and second, for most number of people performing 'aarti' simultaneously, Two new world records were set at this year's Deepotsav in Ayodhya: one, for the largest display of oil lamps, and second, for most number of people performing 'aarti' simultaneously",
    "url": "https://indianexpress.com/article/india/truth-is-not-what-they-showed-akhilesh-yadav-aap-target-bjp-after-ayodhya-deepotsav-record-10318649/",
    "published_date": "2025-10-21T14:27:35+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Truth is not what they showed: Akhilesh Yadav, AAP target BJP after Ayodhya Deepotsav record Two new world records were set at this year's Deepotsav in Ayodhya: one, for the largest display of oil lamps, and second, for most number of people performing 'aarti' simultaneously By: Express Web Deskhttps:indianexpress.comagencyexpress-web-desk New Delhi  October 21, 2025 02:27 PM IST _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit Samajwadi Party SP leader Akhilesh Yadav, and the Aam Aadmi Party Tuesday came down heavily on the Bharatiya Janata Party-led government in Uttar Pradesh over the reality of inflation and poverty that has gripped the state. Posting a video of people collecting leftover oil in earthen lamps  _diyas_ along the ghats of Ayodhya after Deepotsav, Yadav wrote in Hindi: The truth is, these are the scenes not the sights that people showed and then left. It is unclear who shot the video and when.  सच त य दशय ह व नजर नह जनह दखकर लग चल गय   रशन क बद क य अधर अचछ नह pic.twitter.comk35h4rHczuhttps:t.cok35h4rHczu    Akhilesh Yadavhttps:indianexpress.comaboutakhilesh-yadav yadavakhilesh October 20, 2025https:twitter.comyadavakhileshstatus1980299577124348050?ref_srctwsrc5Etfw Meanwhile, the Aam Aadmi Partyhttps:indianexpress.comaboutaam-aadmi-party AAP shared the video from its official handle on X, slamming the BJPhttps:indianexpress.comaboutbjp for its claims about reducing inflationhttps:indianexpress.c",
    "extracted_at": "2025-10-21T16:52:46.513140",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 202,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "News Today Live Updates, 21 October  Trishul Joint Exercise: Southern Command conducts network-centric Agni Drishti, spectrum dominance drill Trinetra",
    "description": "Latest News Live Updates  Agni Drishti is aimed at integrating land, air, space, and unmanned Intelligence, Surveillance, and Reconnaissance ISR assets, while Trinetra focuses on electromagnetic spectrum operations and counter-unmanned aerial system kill-chains, Latest News Live Updates  Agni Drishti is aimed at integrating land, air, space, and unmanned Intelligence, Surveillance, and Reconnaissance ISR assets, while Trinetra focuses on electromagnetic spectrum operations and counter-unmanned aerial system kill-chains.",
    "url": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-10-21-2025-news-headlines-10318153/",
    "published_date": "2025-10-21T15:40:28+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement News Today Live Updates, 21 October  Trishul Joint Exercise: Southern Command conducts network-centric Agni Drishti, spectrum dominance drill Trinetra Latest News Live Updates  Agni Drishti is aimed at integrating land, air, space, and unmanned Intelligence, Surveillance, and Reconnaissance ISR assets, while Trinetra focuses on electromagnetic spectrum operations and counter-unmanned aerial system kill-chains. _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit By: Express Web Deskhttps:indianexpress.comagencyexpress-web-desk Updated: October 21, 2025 03:40 PM IST The banned Communist Party of India Maoist has found a new public voice after its ideological head Mallojula Venugopal Rao alias Sonu surrendered along with 60 cadres in Maharashtra earlier this month. According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay. Pollution levels in Delhihttps:indianexpress.comsectioncitiesdelhi spiked sharply through Diwali night on Monday, with the Delhi Pollution Control Committee DPCC real-time data showing PM2.5 and PM10 concentrations breaching safe limits by 15 to 18 times across several stations. Story continues below this ad The Jharkhand Mukti Morchahttps:indianexpress.comaboutjharkhand-mukti-morcha JMM has announced that the party will not contest the upcoming Assembly elections in Bihar, accusing INDIA bloc allies Congress and RJD of failing to uphold coalit",
    "extracted_at": "2025-10-21T16:52:55.137013",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 206,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "Exclusive: Spate of surrenders later, Maoists get new public liaison who vouches for armed struggle",
    "description": "Commemorate communist Maoist shift: Sonu surrendered; Thippiri Tirupathi 'Devji' now acts as public face 'Abhay', issuing press releases, calling nationwide bandh, accusing surrenderers, and urging continued armed struggle, According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay",
    "url": "https://indianexpress.com/article/india/exclusive-surrenders-maoists-new-public-liaison-vouches-armed-struggle-10318434/",
    "published_date": "2025-10-21T11:53:50+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Exclusive: Spate of surrenders later, Maoists get new public liaison who vouches for armed struggle According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay Written by Nikhila Henryhttps:indianexpress.comprofileauthornikhila-henry New Delhi  October 21, 2025 11:53 AM IST _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit The banned Communist Party of India Maoist has found a new public voice after its ideological head Mallojula Venugopal Rao alias Sonu surrendered along with 60 cadres in Maharashtra earlier this month. According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay. Two press releases  one renouncing Sonu and other prominent leaders of the party who surrendered, and another calling a country-wide bandh on October 24  have come out so far under the name Abhay. The letters were issued on October 16 and came to light three days later. The name Abhay was once commonly used by Sonu to write press releases. Now, the name Abhay is being used by Tirupathi, an intelligence source said, adding, Devuji is hitting out at those who surrendered and gave up arms. Devuji alias Devji hails from Telangana. Story continues below this ad The releases, which brand Sonu and others petty-bourgeois, right-wing, defectors and traitors, also stat",
    "extracted_at": "2025-10-21T16:53:32.654777",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 239,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "In letter to citizens, PM Modi says Bharat a symbol of stability in a world with multiple crises  India News - The Indian Express",
    "description": "He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated, He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated.",
    "url": "https://indianexpress.com/article/india/narendra-modi-bharat-symbol-of-stability-a-world-with-multiple-crises-10318380/",
    "published_date": "2025-10-21T13:46:51+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement In letter to citizens, PM Modi says Bharat a symbol of stability in a world with multiple crises He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated. By: Express Web Deskhttps:indianexpress.comagencyexpress-web-desk New Delhi  Updated: October 21, 2025 01:46 PM IST _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit Prime Minister Narendra Modi Tuesday said India has emerged as a symbol of both stability and sensitivity in a world that is going through multiple crises. In a letter to his fellow citizens, Modi said during Operation Sindoor, India not only upheld righteousness but also avenged injustice. Lord Ram teaches righteousness, gives courage to fight injustice, he added. He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated. Story continues below this ad We are also on track to become worlds third-largest economy in near future, PM Modi said. He urged citizens to adopt swadeshi, respect all languages, prioritise health, reduce oil in food by 10 per cent and embrace yoga. From the homepage Expand Stay updated with the latest - Click here to follow us on Instagramhttps:www.instagram.comindianexpress  IE Online Media Services Pvt Ltd This article went live on October twenty-first, twenty twenty-five, at twelve minutes past eleven in the morning. - Tags: - Narendra Modihttps:indianexpress.c",
    "extracted_at": "2025-10-21T16:53:40.997739",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 240,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "Top 8 Metro cities AQI today: Post-Diwali air quality drops in four Metro cities",
    "description": "Major metropolitan cities in India faced a sharp decline in air quality post-Diwali, with Delhi recording a 'severe' AQI of 447. Residents are advised to stay indoors and wear masks amid worsening smog conditions, Majority metropolitan cities in India showed a significant decline in air quality as parts of the country woke up to smog a day after Diwali was celebrated. Among all metro cities, Delhi recorded the highest air quality index AQI, falling in the severe category as the national capital engulfed in smog on Tuesday morning. According",
    "url": "https://indianexpress.com/article/india/metro-cities-aqi-today-diwali-delhi-severe-aqi-bengaluru-air-quality-10318155/",
    "published_date": "2025-10-21T08:11:35+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Post-Diwali AQI shoots up in four Metro cities, Bengaluru records good air quality Majority metropolitan cities in India showed a significant decline in air quality as parts of the country woke up to smog a day after Diwali was celebrated. Among all metro cities, Delhi recorded the highest air quality index AQI, falling in the severe category as the national capital engulfed in smog on Tuesday morning. According  By: Express Web Deskhttps:indianexpress.comagencyexpress-web-desk New Delhi  October 21, 2025 08:11 AM IST _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit Majority metropolitan cities in India showed a significant decline in air quality as parts of the country woke up to smog a day after Diwali was celebrated. Among all metro cities, Delhi recorded the highest air quality index AQI, falling in the severe category as the national capital engulfed in smog on Tuesday morning. According to the readings by aqi.in, Delhihttps:indianexpress.comsectioncitiesdelhi recorded an AQI of 447 at 7.30 am on Tuesday morning, falling in the severe category. Of the eight total metropolitan cities, the AQI stands above 150 in five cities. Meanwhile, Bengaluruhttps:indianexpress.comsectioncitiesbangalore, Hyderabadhttps:indianexpress.comsectioncitieshyderabad and Chennaihttps:indianexpress.comsectioncitieschennai recorded an AQI less than 100 on Tuesday morning. After Delhi, the worst AQI was recorded in Ahmedabadhttps:indianexpress.comsectioncitiesahmedabad and Kol",
    "extracted_at": "2025-10-21T16:53:50.401273",
    "cleaned_at": "2025-10-21T16:54:01.726900",
    "word_count": 205,
    "is_cleaned": true
  }
]