[
  {
    "source": "The Hindu",
    "title": "From devastation to recovery: How a parasitic wasp saved South Indias tapioca crops",
    "description": "Cassava, better known as tapioca, is grown on about 1.73 lakh hectares in India, with Tamil Nadu and Kerala together contributing more than 90 of total production. Before the outbreak, yields averaged 35 tonnes per hectare, far above the global average of 10.76 tonnes",
    "url": "https://www.thehindu.com/news/national/karnataka/from-devastation-to-recovery-how-a-parasitic-wasp-saved-south-indias-tapioca-crops/article70189313.ece",
    "published_date": "2025-10-22T11:14:29",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Two years after scientists from the National Bureau of Agricultural Insect Resources NBAIR, under the Indian Council of Agricultural Research ICAR, released a tiny parasitic wasp into South Indias tapioca fields, the crop that once faced near devastation from an invasive pest is now thriving again. Farmers in Tamil Nadu, Kerala, and Puducherry report that their tapioca harvests have returned to pre-outbreak levels. This marks a rare success in controlling a major agricultural pest without chemicals. Cassava, better known as tapioca, is grown on about 1.73 lakh hectares in India, with Tamil Nadu and Kerala together contributing more than 90 of total production. Before the outbreak, yields averaged 35 tonnes per hectare, far above the global average of 10.76 tonnes, and India exported value-added tapioca products worth nearly 200 million annually, according to NBAIR officials. However, the mealybugs arrival in Thrissur, Kerala, in April 2020 changed this landscape. By 2021, nearly 1.43 lakh hectares were infested, and some areas of Tamil Nadu saw yields collapse to 512 tonnes per hectare. The pest fed on the plant sap, causing leaf curling, stunted growth, and poor tuber formation. With no effective local predators, the infestation escalated quickly and posed a serious economic threat to farmers, they said. Chemical sprays were considered, but repeated pesticide use was costly, harmful to the environment, and unsustainable for small farmers. ICARNBAIR scientists instead turned to classical biological control, a strategy that introduces a natural enemy from the pests native region to restore ecological balance. In nature, every species has natural enemies that keep its population in check. Scientists identified a tiny parasitic wasp, Anagyrus lopezi, that specifically targets the cassava mealybug. The wasp lays its eggs inside the pest, and the developing larvae consume it from within, naturally reducing mealybug numbers without harming other crops, S. N.",
    "extracted_at": "2025-10-22T17:05:28.565170",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 301,
    "is_cleaned": true
  },
  {
    "source": "The Hindu",
    "title": "RWH pits boost Hyderabads groundwater level; tanker bookings are on the decline: HMWSSB",
    "description": "",
    "url": "https://www.thehindu.com/news/national/telangana/rwh-pits-boost-hyderabads-groundwater-level-tanker-bookings-are-on-the-decline-hmwssb/article70187012.ece",
    "published_date": "2025-10-22T11:05:14",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "The Hyderabad Metropolitan Water Supply  Sewerage Boards campaign to augment groundwater resources in the city,Prathi Intlo Inkudu Guntha or rainwater harvesting pit in every house, according to official data, is yielding results. Similarly, as a relief from the high summer demand, the users dependence on water tankers for daily essentials has seen a decline. Official estimates show that the city received over 30 excess rainfall during the monsoon. While the average rainfall is over 80 cm every year in Hyderabad, the amount absorbed by the earths surface is not more than 1, and the majority is the flood that drains into the Musi river. Citing Ground Water Departments data, the Board said the groundwater level, which had dropped by an average of 14 to 28 meters last summer, has risen by two to 11 meters due to the impact of RWHs. The groundwater level has increased by an average of three to nine meters compared to last year. A division-wise comparison of demand for water tankers, which the Board monitors keenly, also showed that the demand decreased by 12 to 50. Up to 80 of thedemand for tankerscomes from divisions such as Kukatpally, Nizampet, Pragathi Nagar, Serilingampally, Madhapur, Manikonda, and SR Nagar. However, due to the increase in groundwater due to the impact of pits, the booking of tankers has decreased, it explained. The maximum 50 decline was from Vinaynagar division, Durgam Cheruvu 37, Qutbullapur 35, Sahebnagar 32. HMWSSB managing director K. Ashok Reddy observed that there would be no need of a new water supply scheme in the future, if every house harvested rainwater and recharged groundwater. The borewell levels would naturally rise, ensuring access to daily household needs, and saving vast water transport and treatment costs. Published- October 22, 2025 04:35 pm IST economy, business and financeproducts and services",
    "extracted_at": "2025-10-22T17:05:31.918864",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 301,
    "is_cleaned": true
  },
  {
    "source": "The Hindu",
    "title": "PM SHRI, NEP should be implemented in Kerala: Vellappally Natesan",
    "description": "The CPIs opposition to the NEP will disappear once the Kerala Chief Minister holds talks with them. The CPI ultimately agrees to everything, says the SNDP Yogam general secretary",
    "url": "https://www.thehindu.com/news/national/kerala/pm-shri-nep-should-be-implemented-in-kerala-vellappally-natesan/article70189507.ece",
    "published_date": "2025-10-22T11:00:12",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Sree Narayana Dharma Paripalana SNDP Yogam general secretary Vellappally Natesan has said that the Prime Ministers Schools for Rising India PM SHRI scheme should be implemented in Kerala. Speaking to the media on Wednesday October 22, 2025, Mr. Natesan said that if other States were implementing the National Education Policy NEP, Kerala too should implement it. The Communist Party of Indias CPI opposition to the NEP would disappear once Chief Minister Pinarayi Vijayan holds talks with them, he said. If everyone is implementing the NEP, Kerala too should implement it. When all other States are implementing the NEP, why should Kerala stand apart? The CPI ultimately agrees to everything. For the CPI, it is better to remain silent. They are opposing the NEP by calling it saffronisation, but see how far saffron has advanced. It has been ruling the country for more than ten years now. Once Mr. Vijayan intervenes, the CPIs opposition will fade away, Mr. Natesan said. On the Sabarimala gold theft case, he said, Let the one who has eaten the salt drink the water. He said that all devaswom boards should be dissolved. Why is the Sabarimala gold theft case being turned against the State government? The Oppositions demand for resignation of Devaswom Minister V.N. Vasavan is purely political. A new system should be introduced and an Indian Administrative Service officer should be appointed as Secretary. The Kerala High Court is taking strong action and the government too is taking appropriate steps. Then why should Hindu organisations protest? Mr. Natesan asked. Published- October 22, 2025 04:30 pm IST politics and governmentgovernment",
    "extracted_at": "2025-10-22T17:05:32.691757",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 265,
    "is_cleaned": true
  },
  {
    "source": "The Hindu",
    "title": "Supreme Court seeks Centre's assistance on PIL seeking nationwide ban on online gambling",
    "description": "The plea has also sought directions to the RBI, NPCI, and UPI platforms to disallow any monetary transactions involving unregistered gaming applications",
    "url": "https://www.thehindu.com/news/national/supreme-court-seeks-centres-assistance-on-pil-seeking-nationwide-ban-on-online-gambling/article70189544.ece",
    "published_date": "2025-10-22T10:57:07",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "The Supreme Court has sought the Centre's assistance on aplea seeking directions to prohibit online gamblingand betting platforms that allegedly operate under the guise of social and e-sports games. A Bench of justices J.B. Pardiwala and K.V. Viswanathan asked the counsel appearing for the petitioner to serve a copy of the PIL to the counsel for the central government. \"We request V.C. Bharathi to look into the petition and assist us on the next date of hearing. List after two weeks,\" the Bench said in an order passed on Friday October 22, 2025. The Supreme Court was hearing a plea filed by think tank Centre for Accountability and Systemic Change CASC seeking directions to the Centre to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sports games. The plea has also sought directions to the RBI, NPCI, and UPI platforms to disallow any monetary transactions involving unregistered gaming applications. It has sought tax recovery and investigation through Interpol, CBI, and ED against offshore gaming companies, which are estimated to owe over 2 lakh crore in unpaid taxes. The plea has sought a direction to Union ministries of Electronics and Information Technology, Information and Broadcasting, Finance and Youth Affairs and Sports to do a harmonious interpretation of provisions of the Promotion and Regulation of Online Gaming Act, 2025, and laws made by state legislatures to prohibit online gambling and betting games operating in the guise of social and e-sports games. The Act lays down a comprehensive framework to promote safe digital recreation while prohibiting harmful practices linked to online money games. The petition names six respondents, including four Union ministries and the two leading app store operators, Apple Inc. and Google India Pvt. Ltd. The CASC has urged the Supreme Court to direct the government to clamp down on the proliferation of betting and gambling applications, which they claim are infl",
    "extracted_at": "2025-10-22T17:05:33.521213",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 317,
    "is_cleaned": true
  },
  {
    "source": "The Hindu",
    "title": "Two CSIR-NGRI scientists selected as 2024 Telangana Academy of Sciences Fellows",
    "description": "",
    "url": "https://www.thehindu.com/news/national/telangana/two-csir-ngri-scientists-selected-2024-telangana-academy-of-sciences-fellows/article70189422.ece",
    "published_date": "2025-10-22T10:52:19",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Twoscientistsfrom the CSIR-National Geophysical Research Institute NGRI  Labani Ray senior principal scientist and H.V.S. Satyanarayana chief scientist  have been selected as Fellows of Telangana Academy of Sciences 2024. Ms. Ray has established the countrys only laboratory  Centre for Geothermal Energy Research CGER  for measuring rock thermal conductivity at elevated temperatures enabling more accurate geothermal models of Indian Lithosphere. Chief Scientist H.V.S. Satyanarayana  Photo Credit: BY ARRANGEMENT Mr. Satyanarayna has established a test and calibration centre for seismic instruments and led major 2D3D projects for resource exploration and has played a key role in establishing seismic networks across the country for earthquake monitoring and hazard assessment, as per a press release. Science for All  Curiosity-driven research in an unequal world The case for curiosity-driven science Role of higher education in nation-building, scientific mindset in youth emphasised Matching labs with laughs to demystify science for children Published- October 22, 2025 04:22 pm IST science and technologyscientific researchTelanganaHyderabad",
    "extracted_at": "2025-10-22T17:05:34.340475",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 155,
    "is_cleaned": true
  },
  {
    "source": "The Hindu",
    "title": "T.N. government sets up 215 relief camps, 106 community kitchens in Chennai",
    "description": "",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/tn-government-sets-up-215-relief-camps-106-community-kitchens-in-chennai/article70189144.ece",
    "published_date": "2025-10-22T10:38:49",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "The Tamil Nadu government has set up 215 relief camps and 106 community kitchens in Chennai and deployed a total of 24,149 personnel as part of Northeast monsoon relief and rescue operations. According to a press release, following the onset of the Northeast monsoon on October 16, Chief Minister M.K. Stalin has instructed all District Collectors to take safety measures to ensure that people were not affected by the heavy rain. He also chaired a review meeting on October 19 at the State Emergency Operations Centre in Chennai and ordered officials to speed up preparedness measures, safely evacuate people living in coastal and low-lying areas, and keep relief camps ready with essential facilities such as food, drinking water, and medical assistance. A total of 215 relief camps and 106 community kitchens had been established in Chennai. Currently 68 community kitchens have been made operational through which 1,46,950 people affected by the rain were provided breakfast on Wednesday, the press release said. The Integrated Command and Control Centre, which operates round the clock, has been taking immediate action on complaints received from the public through the helpline number, 1913. A total of 22,000 personnel from the Greater Chennai Corporation, including officers, engineers, and sanitation workers, along with 2,149 field staff from the Chennai Metropolitan Water Supply and Sewerage Board, were deployed for relief and rescue work, the release added. Published- October 22, 2025 04:08 pm IST disaster, accident and emergency incidentdisaster",
    "extracted_at": "2025-10-22T17:05:35.231797",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 240,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "IndiGo to operate Mumbai to Madinah direct flights daily from November 15",
    "description": "IndiGo on Wednesday announced that it will operate daily and direct flights between Mumbai and Saudi Arabia's Madinah, starting from November 15. The airline stated in an official release that it will",
    "url": "https://www.hindustantimes.com/india-news/indigo-to-operate-mumbai-to-madinah-direct-flights-daily-from-november-15-101761132188949.html",
    "published_date": "2025-10-22T17:05:41.067154",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "IndiGo on Wednesday announced that it will operate daily and direct flights between Mumbai and Saudi Arabia's Madinah, starting from November 15. The airline stated in an official release that it will operate its Airbus A320 aircraft on this route, adding that flight bookings are now open on its website, mobile application, and across verified travel sites. This will be an addition to IndiGo's existing flights from Hyderabad to Madinah, which operate four times a week, and will be upgraded to a daily service starting November 16. Between India and the four cities in Saudi Arabia  Jeddah, Riyadh, Dammam, and Madinah  the airline operates more than 150 flights. IndiGo also announced its flight schedule between Mumbai and Madinah, effective from November 15. At present, IndiGo is the only Indian airline that flies direct to Madinah. During the Hajj season, several Indian pilgrims visit Madinah to offer prayers at the Prophet's Mosque. For this year's Hajj season, June 4 to June 9, 2025, the Ministry of Minority Affairs said that the Kingdom of Saudi Arabia allotted a quota of 1,75,025 1.75 lakh to India. Hajj is the annual Islamic pilgrimage to Mecca, which, while has its pre-listed dates, takes place depending on the sighting of the moon. The annual pilgrimage follows the path of Prophet Ibrahim and Prophet Muhammad, symbolising their devotion and submission to Allah. Millions of pilgrims undertake Hajj, including several from India.",
    "extracted_at": "2025-10-22T17:05:41.067154",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 234,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "How did helipad collapse shortly after landing of President Murmu's helicopter?",
    "description": "Part of a helipad on which President Droupadi Murmu's helicopter landed in Kerala's Pathanamthitta collapsed shortly after the touchdown on Wednesday morning, necessitating the need for policemen and",
    "url": "https://www.hindustantimes.com/india-news/how-did-helipad-collapse-shortly-after-landing-of-president-droupadi-murmu-helicopter-in-kerala-101761129436901.html",
    "published_date": "2025-10-22T17:05:43.624013",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "Part of a helipad on which President Droupadi Murmu's helicopter landed in Kerala's Pathanamthitta collapsed shortly after the touchdown on Wednesday morning, necessitating the need for policemen and other personnel to push the chopper's wheels out of the caved in portion. The chopper,carrying President Droupadi Murmu, had landed at the Rajiv Gandhi Indoor Stadium in Pathanamthitta's Pramadam for her Sabarimala visit. A senior police officer of the district said that the decision to land President Murmu's helicopter at the Rajiv Gandhi stadium was made at the last moment, after which the helipad was created there late on Tuesday, according to PTI news agency. The landing was originally planned at Nilackal near Pamba, but it was changed to Pramadam due to inclement weather. The concrete of the helipad at the Rajiv Gandhi Indoor Stadium had not set as it was built overnight, the officer said. \"The concrete had not set completely and therefore, it could not handle the helicopter's weight when it landed and depressions were formed where the wheels touched the ground,\" PTI quoted the officer. After the President left for Pamba by road, several policemen and fire force personnel were seen pushing the helicopter's wheels out of the small depressions created when it landed on the concrete. The President landed in Thiruvananthapuram on Tuesday evening for her four-day official Kerala visit. She left on Wednesday morning for Pathanamthitta district, where the hill shrine of Sabarimala is located. From Pramadam, Murmu left for Pamba, the foothills of Sabarimala, via road.",
    "extracted_at": "2025-10-22T17:05:43.624013",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 250,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "Provisions of the SCST Act can't be used to curtail bank's mortgage rights: Delhi HC",
    "description": "New Delhi, The Delhi High Court has said that the provisions of the SCST Act relating to wrongful occupation or dispossession of land belonging to people from Scheduled Castes and Scheduled Tribes ca",
    "url": "https://www.hindustantimes.com/india-news/provisions-of-the-sc-st-act-can-t-be-used-to-curtail-bank-s-mortgage-rights-delhi-hc-101761129533297.html",
    "published_date": "2025-10-22T17:05:46.396544",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "New Delhi, The Delhi High Court has said that the provisions of the SCST Act relating to wrongful occupation or dispossession of land belonging to people from Scheduled Castes and Scheduled Tribes cannot be used to prevent a bank from exercising its lawful mortgage rights. Justice Sachin Datta made the prima facie observation while staying the proceedings initiated by the National Commission for Scheduled Tribes against Axis Bank, its Managing Director and the Chief Executive Officer . \"Prima facie, in the context of the facts of the present case, Sections 3 and of the Atrocities Act are not attracted inasmuch the same cannot be invoked to preclude prevent the exercise of mortgage rightsecurity interest of the petitioner,\" the judge said in an order passed on October 16. The Commission had ordered Axis Bank's MD and CEO to appear in person after a representation was made by a person alleging violation under Sections 3 and of the Scheduled Castes and Scheduled Tribes Act . Section 3 penalises wrongfully occupation or cultivation of land belonging to a member of the SCST community, while Section 3 relates to the punishment of wrongful dispossession of a member of the SCST community of his land or premises. According to the petition before the court, a credit facility of16.69 crore was sanctioned by Axis Bank to Sundev Appliances Ltd, secured by a mortgaged property in Maharashtra's Vasai, in 2013. After the borrower defaulted, the account was declared a non-performing asset in 2017, prompting the bank to invoke its rights under the law, which was followed by a civil dispute over ownership of the mortgaged property. One of the persons involved in the dispute, thereafter, approached the National Commission for Scheduled Tribes. The high court stayed the order saying the proceedings pending before the Commission were without jurisdiction. \"The proceedings pending before respondent no.1 , particularly, the summons issued therein which requires the MD  CEO of the pe",
    "extracted_at": "2025-10-22T17:05:46.396544",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 321,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "SC seeks Centre's assistance on PIL seeking nationwide ban on online gambling",
    "description": "New Delhi, The Supreme Court has sought the Centre's assistance on a plea seeking directions to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sp",
    "url": "https://www.hindustantimes.com/india-news/sc-seeks-centre-s-assistance-on-pil-seeking-nationwide-ban-on-online-gambling-101761129168055.html",
    "published_date": "2025-10-22T17:05:47.688175",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "New Delhi, The Supreme Court has sought the Centre's assistance on a plea seeking directions to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sports games. A bench of justices JB Pardiwala and KV Viswanathan asked the counsel appearing for the petitioner to serve a copy of the PIL to the counsel for the central government. \"We request VC Bharathi to look into the petition and assist us on the next date of hearing. List after two weeks,\" the bench said in an order passed on Friday. The top court was hearing a plea filed by think tank Centre for Accountability and Systemic Change seeking directions to the Centre to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sports games. The plea has also sought directions to the RBI, NPCI, and UPI platforms to disallow any monetary transactions involving unregistered gaming applications. It has sought tax recovery and investigation through Interpol, CBI, and ED against offshore gaming companies, which are estimated to owe over2 lakh crore in unpaid taxes. The plea has sought a direction to Union ministries of Electronics and Information Technology, Information and Broadcasting, Finance and Youth Affairs and Sports to do a harmonious interpretation of provisions of the Promotion and Regulation of Online Gaming Act, 2025, and laws made by state legislatures to prohibit online gambling and betting games operating in the guise of social and e-sports games. The Act lays down a comprehensive framework to promote safe digital recreation while prohibiting harmful practices linked to online money games. The petition names six respondents, including four Union ministries and the two leading app store operators, Apple Inc. and Google India Pvt. Ltd. The CASC has urged the top court to direct the government to clamp down on the proliferation of betting and gambling applications, which they claim are inflicting widespread social and",
    "extracted_at": "2025-10-22T17:05:47.688175",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 319,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "SC goes extra mile to ensure widow gets Railways' compensation after 23 years of legal battle",
    "description": "New Delhi, For a tragedy-struck widow, who lost her husband in a train accident in 2002, the Supreme Court went the extra mile to ensure that she is duly compensated by the Railways after years of str",
    "url": "https://www.hindustantimes.com/india-news/sc-goes-extra-mile-to-ensure-widow-gets-railways-compensation-after-23-years-of-legal-battle-101761128067548.html",
    "published_date": "2025-10-22T17:05:49.052633",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "New Delhi, For a tragedy-struck widow, who lost her husband in a train accident in 2002, the Supreme Court went the extra mile to ensure that she is duly compensated by the Railways after years of struggle. Saynokta Devi's husband Vijay Singh had a valid railway ticket from Bakhtiyarpur station to go to Patna by the Bhagalpur-Danapur Intercity Express on March 21, 2002, but he accidentally fell down from the running train at the originating station itself, due to heavy rush inside the compartment and died instantly. What followed was a legal battle for next two decades, as Devi's claim for compensation was turned down by the Railway Claims Tribunal and the Patna High Court on the ground that the deceased was of unsound mind. Aggrieved by the high court's order denying her claim, she, through her lawyer Fauzia Shakil, approached the apex court. The Supreme Court in 2023 rejected the reasoning given by the Railway Claims Tribunal and the Patna High Court and set aside the orders terming them \"completely absurd\", \"imaginary\" and \"contrary to the undisputed facts on record\". \"What emerges is the fact that the appellant's claim was not accepted by both the Tribunal and the High Court solely on the ground that the deceased was of unsound mind and he was knocked down by an unidentified train,\" the top court had noted in its order of February 2, 2023. A bench headed by Justice Surya Kant had observed that if the deceased would have been of unsound mind, it would have been nearly impossible for him to purchase a valid railway ticket for travel to Patna and could not have tried to board the train all by himself. The top court directed the Railways to pay the widow within two months a compensation of4 lakh with six per cent interest per annum from the date of filing of the claim petition. But to her bad luck, her local counsel could not convey her the order as he passed away. The railways on other hand tried to comply with the order and wrote different letters to Devi but c",
    "extracted_at": "2025-10-22T17:05:49.052633",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 352,
    "is_cleaned": true
  },
  {
    "source": "Hindustan Times",
    "title": "Govt releases draft amendments to regulate AI or synthetically-generated info",
    "description": "The ministry of electronics and information technology MeitY has released draft amendments to the Information Technology Intermediary Guidelines and Digital Media Ethics Code Rules, 2021, introduc",
    "url": "https://www.hindustantimes.com/india-news/govt-releases-draft-amendments-to-regulate-ai-or-synthetically-generated-info-101761126663943.html",
    "published_date": "2025-10-22T17:05:51.697134",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "The ministry of electronics and information technology MeitY has released draft amendments to the Information Technology Intermediary Guidelines and Digital Media Ethics Code Rules, 2021, introducing a framework to identify and regulate AI-generated or synthetically-generated information. It has invited public feedback on the amendments by November 6. The definition of synthetically generated information is a key proposed change. It has been described as any information artificially or algorithmically created, generated, modified or altered using a computer resource in a manner that appears reasonably authentic or true. With this definition, the government seeks to bring AI-generated content under the due diligence and takedown obligations applicable to unlawful online information. The draft amendments make labelling and traceability mandatory for synthetic content. Intermediaries offering tools that create or modify digital media are required to ensure such information carries a visible or audible label or an embedded permanent metadata identifier that clearly marks it as AI-generated. For images or videos, the label must cover at least 10 of the surface area. For audio, it must be played during the first 10 of its duration. Intermediaries will be prohibited from suppressing or removing such identifiers, making it difficult to disguise the origin of AI-generated content. For large social media platforms, referred to as significant social media intermediaries, the obligations are more elaborate. These companies will be required to ask users to declare whether their uploaded content is synthetically-generated before publication. They must also deploy reasonable and proportionate technical measures like automated detection systems to verify the same. Verified or declared synthetic content must be clearly labelled or accompanied by a visible notice, allowing users to distinguish authentic media from manipulated material. Failure to comply could expose these",
    "extracted_at": "2025-10-22T17:05:51.697134",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 282,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "Amid seat-sharing tensions, Tejashwis new promises  permanent jobs for jeevikas, womens welfare schemes  India News - The Indian Express",
    "description": "At a press conference, Bihar's Leader of Opposition Tejashwi Yadav dismissed rumours of friction between his RJD and the Congress. , At a press conference, Bihar's Leader of Opposition Tejashwi Yadav dismissed rumours of friction between his RJD and the Congress.",
    "url": "https://indianexpress.com/article/india/seat-sharing-tejashwi-yadav-jobs-for-jeevika-women-welfare-schemes-10320693/",
    "published_date": "2025-10-22T15:57:04+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Amid seat-sharing tensions, Tejashwis new promises  permanent jobs for jeevikas, womens welfare schemes At a press conference, Bihar's Leader of Opposition Tejashwi Yadav dismissed rumours of friction between his RJD and the Congress. PatnaOctober 22, 2025 03:57 PM IST First published on: Oct 22, 2025 at 03:56 PM IST - !share-btnhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesiconly-regular-outline-send.svg Share - !comment-btnhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesiconly-regular-outline-chat.svg Comments - !prrint-btnhttps:indianexpress.comwp-contentthemesindianexpressimagesprint.svg Print - !google-preferred-btnhttps:images.indianexpress.com202508Google-button-2.gifhttps:www.google.compreferencessource?qindianexpress.com Offering job permanence to Bihars two-lakh Jeevika community mobilisers and an equal number of contractual employees, ensuring education and employment for girls, and providing houses, adequate ration and incomes for women  these are among the Mahagathbandhans new promises that the states Leader of Opposition Tejashwi Yadav has made in the run-up to the assembly elections. He also dismissed rumours of friction within the alliance over seat-sharing. At a press conference Wednesday, Yadav, who is leading the Rashtriya Janata Dalhttps:indianexpress.comaboutrashtriya-janata-dals election campaign in the state, announced a series of measures for Jeevika didis  the women associated with the state governments World Bank-aided Bihar Rural Livelihoods Project BRLP for the social and economic empowerment of the rural poor, also known as Jeevika. This includes interest-free loans for two years. The state currently has about 1.4 crore Jeevika workers from about 11 lakh self-help groups SHGs of women. Advertisement Community mobiliser CM didis bear the burden of so many responsibilities. We would offer them permanent jobs fo",
    "extracted_at": "2025-10-22T17:06:16.185453",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 224,
    "is_cleaned": true
  },
  {
    "source": "Indian Express",
    "title": "Prof Eknath Chitnis, veteran scientist who pioneered Indias space programme, dies at 100",
    "description": "Veteran space scientist Professor Eknath Vasant Chitnis, instrumental in India's space program and ISRO's founding, passed away in Pune at 100. His legacy includes the historic Satellite Instructional Television Experiment that revolutionized education in India, Eknath Chitnis was handpicked by Vikram Sarabhai to develop the countrys space programme and played a key role in establishing the Indian Space Research Organisation Isro.",
    "url": "https://indianexpress.com/article/india/prof-eknath-chitnis-veteran-scientist-pioneered-india-space-programme-dies-10320275/",
    "published_date": "2025-10-22T12:46:31+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Prof Eknath Chitnis, veteran scientist who pioneered Indias space programme, dies at 100 Eknath Chitnis was handpicked by Vikram Sarabhai to develop the countrys space programme and played a key role in establishing the Indian Space Research Organisation Isro. Written by Anjali Mararhttps:indianexpress.comprofileauthoranjali-marar Bengaluru  Updated: October 22, 2025 12:46 PM IST _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit Veteran space scientist Professor Eknath Vasant Chitnis passed away in Pune on Wednesday. He was 100. Among the pioneers of the countrys space programme, Chitnis had played a key role in establishing the Indian Space Research Organisation  Isrohttps:indianexpress.comaboutisro. His last rites will be performed in Punehttps:indianexpress.comsectioncitiespune on Wednesday afternoon. Handpicked by Vikram Sarabhai, the father of Indias space programme, Chitnis was known to be his right-hand man and led a team that scouted for a launchpad, before zeroing down on Thumba in Thiruvananthapuram, and later Sriharikota along the coast of Andhra Pradesh. Story continues below this ad Chitnis had retired as the director of the Space Application Centre in Ahmedabadhttps:indianexpress.comsectioncitiesahmedabad in the mid-1980s, following which he, along with his wife, the late Kumud Chitnis, settled in Pune. His most significant contribution came through the Satellite Instructional Television Experiment SITE in 1975-76, which he directed. This project conducted educational p",
    "extracted_at": "2025-10-22T17:07:21.261963",
    "cleaned_at": "2025-10-22T17:07:41.966328",
    "word_count": 209,
    "is_cleaned": true
  }
]