[
  {
    "original": {
      "source": "The Hindu",
      "title": "From devastation to recovery: How a parasitic wasp saved South Indias tapioca crops",
      "description": "Cassava, better known as tapioca, is grown on about 1.73 lakh hectares in India, with Tamil Nadu and Kerala together contributing more than 90 of total production. Before the outbreak, yields averaged 35 tonnes per hectare, far above the global average of 10.76 tonnes",
      "url": "https://www.thehindu.com/news/national/karnataka/from-devastation-to-recovery-how-a-parasitic-wasp-saved-south-indias-tapioca-crops/article70189313.ece",
      "published_date": "2025-10-22T11:14:29",
      "category": "national",
      "extraction_method": "rss",
      "raw_content": "Two years after scientists from the National Bureau of Agricultural Insect Resources NBAIR, under the Indian Council of Agricultural Research ICAR, released a tiny parasitic wasp into South Indias tapioca fields, the crop that once faced near devastation from an invasive pest is now thriving again. Farmers in Tamil Nadu, Kerala, and Puducherry report that their tapioca harvests have returned to pre-outbreak levels. This marks a rare success in controlling a major agricultural pest without chemicals. Cassava, better known as tapioca, is grown on about 1.73 lakh hectares in India, with Tamil Nadu and Kerala together contributing more than 90 of total production. Before the outbreak, yields averaged 35 tonnes per hectare, far above the global average of 10.76 tonnes, and India exported value-added tapioca products worth nearly 200 million annually, according to NBAIR officials. However, the mealybugs arrival in Thrissur, Kerala, in April 2020 changed this landscape. By 2021, nearly 1.43 lakh hectares were infested, and some areas of Tamil Nadu saw yields collapse to 512 tonnes per hectare. The pest fed on the plant sap, causing leaf curling, stunted growth, and poor tuber formation. With no effective local predators, the infestation escalated quickly and posed a serious economic threat to farmers, they said. Chemical sprays were considered, but repeated pesticide use was costly, harmful to the environment, and unsustainable for small farmers. ICARNBAIR scientists instead turned to classical biological control, a strategy that introduces a natural enemy from the pests native region to restore ecological balance. In nature, every species has natural enemies that keep its population in check. Scientists identified a tiny parasitic wasp, Anagyrus lopezi, that specifically targets the cassava mealybug. The wasp lays its eggs inside the pest, and the developing larvae consume it from within, naturally reducing mealybug numbers without harming other crops, S. N.",
      "extracted_at": "2025-10-22T17:05:28.565170",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 301,
      "is_cleaned": true
    },
    "source": "The Hindu",
    "title": "From devastation to recovery: How a parasitic wasp saved South Indias tapioca crops",
    "url": "https://www.thehindu.com/news/national/karnataka/from-devastation-to-recovery-how-a-parasitic-wasp-saved-south-indias-tapioca-crops/article70189313.ece",
    "published_date": "2025-10-22T11:14:29",
    "category": "national",
    "simplified_base": "**Tiny Wasp Saves Tapioca Farms!**\n\nImagine a yummy root vegetable called tapioca. It's like a potato but grows in warm places. Farmers in South India grow lots of it. It's a very important food for them.\n\nBut then, a tiny bug called a mealybug came. These bugs were like tiny vampires. They sucked the juice from the tapioca plants. The plants got sick. Their leaves curled up. They didn't grow well. The yummy roots didn't get big.\n\nThis was very bad for the farmers. Their tapioca crops were almost ruined. It was like a big disaster for their farms. The mealybugs were everywhere. They spread very fast.\n\nFarmers tried to fight the bugs. But using strong bug sprays was not good. It cost too much money. It was also bad for the earth. And it was hard for farmers with small farms.\n\nScientists wanted to help. They are like nature detectives. They looked for a natural way to stop the bugs. They knew that in nature, bugs have enemies. These enemies help keep bug numbers down.\n\nThe scientists found a special helper. It was a very, very tiny wasp. This wasp was called Anagyrus lopezi. It was like a superhero for tapioca!\n\nThis tiny wasp is very picky. It only likes to eat the bad mealybugs. The wasp lays its eggs inside the mealybug. Then, the baby wasps eat the mealybug from the inside. This is a very clever way to stop the bugs.\n\nThe scientists brought these tiny wasps to the tapioca farms. They let them loose to do their job. It was like sending in a tiny army of helpers.\n\nAnd guess what? It worked! The tiny wasps ate the mealybugs. The mealybug numbers went down. The tapioca plants started to get better.\n\nNow, after two years, the tapioca farms are happy again. The farmers are getting lots of tapioca. Their harvests are as good as before the mealybugs came.\n\nThis is a super success story! It shows how nature can help us. We didn't need to use harmful chemicals. A tiny wasp saved the day for the tapioca crops. It's a great example of working with nature.",
    "age_groups": {
      "group_1": {
        "text": "**Tiny Wasp Saves Tapioca Farms!** Imagine a yummy root vegetable called tapioca. It's like a potato but grows in warm places. Farmers in South India grow lots of it. It's a very important food for them. But then, a tiny bug called a mealybug came. These bugs were like tiny...",
        "word_count": 50,
        "sentence_count": 7,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Tiny Wasp Saves Tapioca Farms!** Imagine a yummy root vegetable called tapioca. It's like a potato but grows in warm places. Farmers in South India grow lots of it. It's a very important food for them. But then, a tiny bug called a mealybug came. These bugs were like tiny vampires. They sucked the juice from the tapioca plants. The plants got sick. Their leaves curled up. They didn't grow well. The yummy roots didn't get big. This was very bad for the farmers. Their tapioca crops were almost ruined. It was like a big disaster for their farms. The...",
        "word_count": 100,
        "sentence_count": 16,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Tiny Wasp Saves Tapioca Farms!** Imagine a yummy root vegetable called tapioca. It's like a potato but grows in warm places. Farmers in South India grow lots of it. It's a very important food for them. But then, a tiny bug called a mealybug came. These bugs were like tiny vampires. They sucked the juice from the tapioca plants. The plants got sick. Their leaves curled up. They didn't grow well. The yummy roots didn't get big. This was very bad for the farmers. Their tapioca crops were almost ruined. It was like a big disaster for their farms. The mealybugs were everywhere. They spread very fast. Farmers tried to fight the bugs. But using strong bug sprays was not good. It cost too much money. It was also bad for the earth. And it was hard for farmers with small farms. Scientists wanted to help. They are like nature...",
        "word_count": 150,
        "sentence_count": 24,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:07:46.773408"
  },
  {
    "original": {
      "source": "The Hindu",
      "title": "RWH pits boost Hyderabads groundwater level; tanker bookings are on the decline: HMWSSB",
      "description": "",
      "url": "https://www.thehindu.com/news/national/telangana/rwh-pits-boost-hyderabads-groundwater-level-tanker-bookings-are-on-the-decline-hmwssb/article70187012.ece",
      "published_date": "2025-10-22T11:05:14",
      "category": "national",
      "extraction_method": "rss",
      "raw_content": "The Hyderabad Metropolitan Water Supply  Sewerage Boards campaign to augment groundwater resources in the city,Prathi Intlo Inkudu Guntha or rainwater harvesting pit in every house, according to official data, is yielding results. Similarly, as a relief from the high summer demand, the users dependence on water tankers for daily essentials has seen a decline. Official estimates show that the city received over 30 excess rainfall during the monsoon. While the average rainfall is over 80 cm every year in Hyderabad, the amount absorbed by the earths surface is not more than 1, and the majority is the flood that drains into the Musi river. Citing Ground Water Departments data, the Board said the groundwater level, which had dropped by an average of 14 to 28 meters last summer, has risen by two to 11 meters due to the impact of RWHs. The groundwater level has increased by an average of three to nine meters compared to last year. A division-wise comparison of demand for water tankers, which the Board monitors keenly, also showed that the demand decreased by 12 to 50. Up to 80 of thedemand for tankerscomes from divisions such as Kukatpally, Nizampet, Pragathi Nagar, Serilingampally, Madhapur, Manikonda, and SR Nagar. However, due to the increase in groundwater due to the impact of pits, the booking of tankers has decreased, it explained. The maximum 50 decline was from Vinaynagar division, Durgam Cheruvu 37, Qutbullapur 35, Sahebnagar 32. HMWSSB managing director K. Ashok Reddy observed that there would be no need of a new water supply scheme in the future, if every house harvested rainwater and recharged groundwater. The borewell levels would naturally rise, ensuring access to daily household needs, and saving vast water transport and treatment costs. Published- October 22, 2025 04:35 pm IST economy, business and financeproducts and services",
      "extracted_at": "2025-10-22T17:05:31.918864",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 301,
      "is_cleaned": true
    },
    "source": "The Hindu",
    "title": "RWH pits boost Hyderabads groundwater level; tanker bookings are on the decline: HMWSSB",
    "url": "https://www.thehindu.com/news/national/telangana/rwh-pits-boost-hyderabads-groundwater-level-tanker-bookings-are-on-the-decline-hmwssb/article70187012.ece",
    "published_date": "2025-10-22T11:05:14",
    "category": "national",
    "simplified_base": "**Rainy Day Pits Help Hyderabad Get More Water!**\n\nHyderabad has a special plan. It's called \"Rainy Day Pits.\" This plan helps the city have more water underground. It's like giving the earth a big drink!\n\nEvery house is asked to make a pit. This pit catches rainwater. It's called a \"rainwater harvesting pit.\" This is helping a lot!\n\nBecause of these pits, people don't need water trucks as much. Water trucks bring water when there isn't enough. Now, fewer people are calling for them.\n\nLast year, Hyderabad got lots of rain. But much of the rain just flowed away. It went into a river. Not much water went into the ground.\n\nBut this year is different! The rainy day pits are catching the water. The water is going deep into the ground. It's making the underground water level go up.\n\nLast summer, the underground water was very low. It was much lower than usual. But now, it's much higher! It's like the ground is happy again.\n\nThe city is also watching how many water trucks are needed. They saw that fewer trucks are being booked. This is great news!\n\nSome parts of the city used to need many water trucks. Now, they need much fewer. This is because the pits are working so well.\n\nOne area called Vinaynagar saw the biggest change. They needed 50% fewer water trucks! Other areas also saw big drops.\n\nA leader named K. Ashok Reddy said something important. He said if every house has a rainy day pit, we won't need new water plans. The underground water will be full.\n\nThis means wells will have enough water. We won't have to spend lots of money to move and clean water. It's a smart way to save water for everyone!",
    "age_groups": {
      "group_1": {
        "text": "**Rainy Day Pits Help Hyderabad Get More Water!** Hyderabad has a special plan. It's called \"Rainy Day Pits.\" This plan helps the city have more water underground. It's like giving the earth a big drink! Every house is asked to make a pit. This pit catches rainwater. It's called a...",
        "word_count": 50,
        "sentence_count": 8,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Rainy Day Pits Help Hyderabad Get More Water!** Hyderabad has a special plan. It's called \"Rainy Day Pits.\" This plan helps the city have more water underground. It's like giving the earth a big drink! Every house is asked to make a pit. This pit catches rainwater. It's called a \"rainwater harvesting pit.\" This is helping a lot! Because of these pits, people don't need water trucks as much. Water trucks bring water when there isn't enough. Now, fewer people are calling for them. Last year, Hyderabad got lots of rain. But much of the rain just flowed away. It...",
        "word_count": 100,
        "sentence_count": 15,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Rainy Day Pits Help Hyderabad Get More Water!** Hyderabad has a special plan. It's called \"Rainy Day Pits.\" This plan helps the city have more water underground. It's like giving the earth a big drink! Every house is asked to make a pit. This pit catches rainwater. It's called a \"rainwater harvesting pit.\" This is helping a lot! Because of these pits, people don't need water trucks as much. Water trucks bring water when there isn't enough. Now, fewer people are calling for them. Last year, Hyderabad got lots of rain. But much of the rain just flowed away. It went into a river. Not much water went into the ground. But this year is different! The rainy day pits are catching the water. The water is going deep into the ground. It's making the underground water level go up. Last summer, the underground water was very low. It was...",
        "word_count": 150,
        "sentence_count": 22,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:07:50.357595"
  },
  {
    "original": {
      "source": "The Hindu",
      "title": "PM SHRI, NEP should be implemented in Kerala: Vellappally Natesan",
      "description": "The CPIs opposition to the NEP will disappear once the Kerala Chief Minister holds talks with them. The CPI ultimately agrees to everything, says the SNDP Yogam general secretary",
      "url": "https://www.thehindu.com/news/national/kerala/pm-shri-nep-should-be-implemented-in-kerala-vellappally-natesan/article70189507.ece",
      "published_date": "2025-10-22T11:00:12",
      "category": "national",
      "extraction_method": "rss",
      "raw_content": "Sree Narayana Dharma Paripalana SNDP Yogam general secretary Vellappally Natesan has said that the Prime Ministers Schools for Rising India PM SHRI scheme should be implemented in Kerala. Speaking to the media on Wednesday October 22, 2025, Mr. Natesan said that if other States were implementing the National Education Policy NEP, Kerala too should implement it. The Communist Party of Indias CPI opposition to the NEP would disappear once Chief Minister Pinarayi Vijayan holds talks with them, he said. If everyone is implementing the NEP, Kerala too should implement it. When all other States are implementing the NEP, why should Kerala stand apart? The CPI ultimately agrees to everything. For the CPI, it is better to remain silent. They are opposing the NEP by calling it saffronisation, but see how far saffron has advanced. It has been ruling the country for more than ten years now. Once Mr. Vijayan intervenes, the CPIs opposition will fade away, Mr. Natesan said. On the Sabarimala gold theft case, he said, Let the one who has eaten the salt drink the water. He said that all devaswom boards should be dissolved. Why is the Sabarimala gold theft case being turned against the State government? The Oppositions demand for resignation of Devaswom Minister V.N. Vasavan is purely political. A new system should be introduced and an Indian Administrative Service officer should be appointed as Secretary. The Kerala High Court is taking strong action and the government too is taking appropriate steps. Then why should Hindu organisations protest? Mr. Natesan asked. Published- October 22, 2025 04:30 pm IST politics and governmentgovernment",
      "extracted_at": "2025-10-22T17:05:32.691757",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 265,
      "is_cleaned": true
    },
    "source": "The Hindu",
    "title": "PM SHRI, NEP should be implemented in Kerala: Vellappally Natesan",
    "url": "https://www.thehindu.com/news/national/kerala/pm-shri-nep-should-be-implemented-in-kerala-vellappally-natesan/article70189507.ece",
    "published_date": "2025-10-22T11:00:12",
    "category": "national",
    "simplified_base": "**New School Plans for Kerala!**\n\nA leader named Vellappally Natesan has a big idea. He wants Kerala to use new school plans. One plan is called PM SHRI. This plan helps make schools better. He said other states are using it. So, Kerala should use it too.\n\nThere is also a new education rule. It's called NEP. Mr. Natesan thinks Kerala should follow NEP. Some people in Kerala don't like NEP. They say it's like a certain color. But Mr. Natesan thinks they will change their minds. He said the Chief Minister can talk to them. Then they will agree. He said it's better for them to be quiet.\n\nHe also talked about a gold theft. It happened at a temple called Sabarimala. Someone stole gold from there. Mr. Natesan said the person who did it should be found. He thinks all the temple boards should be changed. He asked why the government is blamed. He said some people want a minister to quit. But he thinks it's just for politics.\n\nHe said a new system is needed. An officer should be in charge. The court is doing good work. The government is also helping. So, he asked why Hindu groups are upset.",
    "age_groups": {
      "group_1": {
        "text": "**New School Plans for Kerala!** A leader named Vellappally Natesan has a big idea. He wants Kerala to use new school plans. One plan is called PM SHRI. This plan helps make schools better. He said other states are using it. So, Kerala should use it too. There is also...",
        "word_count": 50,
        "sentence_count": 8,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**New School Plans for Kerala!** A leader named Vellappally Natesan has a big idea. He wants Kerala to use new school plans. One plan is called PM SHRI. This plan helps make schools better. He said other states are using it. So, Kerala should use it too. There is also a new education rule. It's called NEP. Mr. Natesan thinks Kerala should follow NEP. Some people in Kerala don't like NEP. They say it's like a certain color. But Mr. Natesan thinks they will change their minds. He said the Chief Minister can talk to them. Then they will agree.",
        "word_count": 100,
        "sentence_count": 17,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**New School Plans for Kerala!** A leader named Vellappally Natesan has a big idea. He wants Kerala to use new school plans. One plan is called PM SHRI. This plan helps make schools better. He said other states are using it. So, Kerala should use it too. There is also a new education rule. It's called NEP. Mr. Natesan thinks Kerala should follow NEP. Some people in Kerala don't like NEP. They say it's like a certain color. But Mr. Natesan thinks they will change their minds. He said the Chief Minister can talk to them. Then they will agree. He said it's better for them to be quiet. He also talked about a gold theft. It happened at a temple called Sabarimala. Someone stole gold from there. Mr. Natesan said the person who did it should be found. He thinks all the temple boards should be changed. He asked...",
        "word_count": 150,
        "sentence_count": 25,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:07:53.407208"
  },
  {
    "original": {
      "source": "The Hindu",
      "title": "Supreme Court seeks Centre's assistance on PIL seeking nationwide ban on online gambling",
      "description": "The plea has also sought directions to the RBI, NPCI, and UPI platforms to disallow any monetary transactions involving unregistered gaming applications",
      "url": "https://www.thehindu.com/news/national/supreme-court-seeks-centres-assistance-on-pil-seeking-nationwide-ban-on-online-gambling/article70189544.ece",
      "published_date": "2025-10-22T10:57:07",
      "category": "national",
      "extraction_method": "rss",
      "raw_content": "The Supreme Court has sought the Centre's assistance on aplea seeking directions to prohibit online gamblingand betting platforms that allegedly operate under the guise of social and e-sports games. A Bench of justices J.B. Pardiwala and K.V. Viswanathan asked the counsel appearing for the petitioner to serve a copy of the PIL to the counsel for the central government. \"We request V.C. Bharathi to look into the petition and assist us on the next date of hearing. List after two weeks,\" the Bench said in an order passed on Friday October 22, 2025. The Supreme Court was hearing a plea filed by think tank Centre for Accountability and Systemic Change CASC seeking directions to the Centre to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sports games. The plea has also sought directions to the RBI, NPCI, and UPI platforms to disallow any monetary transactions involving unregistered gaming applications. It has sought tax recovery and investigation through Interpol, CBI, and ED against offshore gaming companies, which are estimated to owe over 2 lakh crore in unpaid taxes. The plea has sought a direction to Union ministries of Electronics and Information Technology, Information and Broadcasting, Finance and Youth Affairs and Sports to do a harmonious interpretation of provisions of the Promotion and Regulation of Online Gaming Act, 2025, and laws made by state legislatures to prohibit online gambling and betting games operating in the guise of social and e-sports games. The Act lays down a comprehensive framework to promote safe digital recreation while prohibiting harmful practices linked to online money games. The petition names six respondents, including four Union ministries and the two leading app store operators, Apple Inc. and Google India Pvt. Ltd. The CASC has urged the Supreme Court to direct the government to clamp down on the proliferation of betting and gambling applications, which they claim are infl",
      "extracted_at": "2025-10-22T17:05:33.521213",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 317,
      "is_cleaned": true
    },
    "source": "The Hindu",
    "title": "Supreme Court seeks Centre's assistance on PIL seeking nationwide ban on online gambling",
    "url": "https://www.thehindu.com/news/national/supreme-court-seeks-centres-assistance-on-pil-seeking-nationwide-ban-on-online-gambling/article70189544.ece",
    "published_date": "2025-10-22T10:57:07",
    "category": "national",
    "simplified_base": "**Kids, Let's Talk About Online Games!**\n\nImagine playing fun games on your tablet or computer. Some games are just for playing. But some games are tricky. They look like fun games. But they are actually for betting money. This is like gambling.\n\nA very important court in India is called the Supreme Court. It's like the biggest judge in the country. Someone told the Supreme Court about these tricky games. They said these games are like a disguise. They hide real gambling.\n\nThe Supreme Court wants to help. They asked the government to help them. The government needs to look into this problem. They want to stop these fake games.\n\nA group called CASC told the Supreme Court about this. They want to ban online gambling games. They said these games are pretending to be social games. Or they pretend to be e-sports games. E-sports are like video game competitions.\n\nThe CASC also wants to stop money from going to these games. They asked banks and money apps to help. They don't want people to pay for these fake games.\n\nThey also want to get money back. Some companies that run these games owe a lot of money. It's like they didn't pay their taxes. This is a very big amount of money.\n\nThe Supreme Court wants the government to make new rules. These rules will help stop online gambling. They will make sure games are safe for kids.\n\nThe government has to work with different groups. They need to understand the rules for online games. They want to stop games that are really gambling.\n\nThe people who made the rules want to help fun games. But they want to stop bad games. The bad games are the ones that take your money.\n\nThe CASC told the Supreme Court who is involved. It's not just the government. It's also the companies that have app stores. These are like big shops for games. Apple and Google are two of these companies.\n\nThe CASC wants the Supreme Court to tell the government to stop these games. They are worried about too many betting games. They say these games are hurting people.",
    "age_groups": {
      "group_1": {
        "text": "**Kids, Let's Talk About Online Games!** Imagine playing fun games on your tablet or computer. Some games are just for playing. But some games are tricky. They look like fun games. But they are actually for betting money. This is like gambling. A very important court in India is called...",
        "word_count": 50,
        "sentence_count": 8,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Kids, Let's Talk About Online Games!** Imagine playing fun games on your tablet or computer. Some games are just for playing. But some games are tricky. They look like fun games. But they are actually for betting money. This is like gambling. A very important court in India is called the Supreme Court. It's like the biggest judge in the country. Someone told the Supreme Court about these tricky games. They said these games are like a disguise. They hide real gambling. The Supreme Court wants to help. They asked the government to help them. The government needs to look...",
        "word_count": 100,
        "sentence_count": 15,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Kids, Let's Talk About Online Games!** Imagine playing fun games on your tablet or computer. Some games are just for playing. But some games are tricky. They look like fun games. But they are actually for betting money. This is like gambling. A very important court in India is called the Supreme Court. It's like the biggest judge in the country. Someone told the Supreme Court about these tricky games. They said these games are like a disguise. They hide real gambling. The Supreme Court wants to help. They asked the government to help them. The government needs to look into this problem. They want to stop these fake games. A group called CASC told the Supreme Court about this. They want to ban online gambling games. They said these games are pretending to be social games. Or they pretend to be e-sports games. E-sports are like video game competitions.",
        "word_count": 150,
        "sentence_count": 21,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:07:57.615858"
  },
  {
    "original": {
      "source": "The Hindu",
      "title": "Two CSIR-NGRI scientists selected as 2024 Telangana Academy of Sciences Fellows",
      "description": "",
      "url": "https://www.thehindu.com/news/national/telangana/two-csir-ngri-scientists-selected-2024-telangana-academy-of-sciences-fellows/article70189422.ece",
      "published_date": "2025-10-22T10:52:19",
      "category": "national",
      "extraction_method": "rss",
      "raw_content": "Twoscientistsfrom the CSIR-National Geophysical Research Institute NGRI  Labani Ray senior principal scientist and H.V.S. Satyanarayana chief scientist  have been selected as Fellows of Telangana Academy of Sciences 2024. Ms. Ray has established the countrys only laboratory  Centre for Geothermal Energy Research CGER  for measuring rock thermal conductivity at elevated temperatures enabling more accurate geothermal models of Indian Lithosphere. Chief Scientist H.V.S. Satyanarayana  Photo Credit: BY ARRANGEMENT Mr. Satyanarayna has established a test and calibration centre for seismic instruments and led major 2D3D projects for resource exploration and has played a key role in establishing seismic networks across the country for earthquake monitoring and hazard assessment, as per a press release. Science for All  Curiosity-driven research in an unequal world The case for curiosity-driven science Role of higher education in nation-building, scientific mindset in youth emphasised Matching labs with laughs to demystify science for children Published- October 22, 2025 04:22 pm IST science and technologyscientific researchTelanganaHyderabad",
      "extracted_at": "2025-10-22T17:05:34.340475",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 155,
      "is_cleaned": true
    },
    "source": "The Hindu",
    "title": "Two CSIR-NGRI scientists selected as 2024 Telangana Academy of Sciences Fellows",
    "url": "https://www.thehindu.com/news/national/telangana/two-csir-ngri-scientists-selected-2024-telangana-academy-of-sciences-fellows/article70189422.ece",
    "published_date": "2025-10-22T10:52:19",
    "category": "national",
    "simplified_base": "**Two Smart Scientists Get a Big Award!**\n\nTwo scientists from a special science place are getting a big award. Their names are Labani Ray and H.V.S. Satyanarayana. They work at the CSIR-NGRI lab. This lab studies the Earth.\n\nLabani Ray is a very important scientist. She made a special lab. It is the only one like it in our country. This lab helps measure how hot rocks get. This helps us understand the Earth better.\n\nH.V.S. Satyanarayana is also a chief scientist. He made a place to test science tools. These tools help us listen to the Earth. He also helped build networks to watch for earthquakes. This helps keep people safe.\n\nThe Telangana Academy of Sciences is giving them this award. It is for their amazing science work. They are very good at what they do!",
    "age_groups": {
      "group_1": {
        "text": "**Two Smart Scientists Get a Big Award!** Two scientists from a special science place are getting a big award. Their names are Labani Ray and H.V.S. Satyanarayana. They work at the CSIR-NGRI lab. This lab studies the Earth. Labani Ray is a very important scientist. She made a special lab.",
        "word_count": 50,
        "sentence_count": 10,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Two Smart Scientists Get a Big Award!** Two scientists from a special science place are getting a big award. Their names are Labani Ray and H.V.S. Satyanarayana. They work at the CSIR-NGRI lab. This lab studies the Earth. Labani Ray is a very important scientist. She made a special lab. It is the only one like it in our country. This lab helps measure how hot rocks get. This helps us understand the Earth better. H.V.S. Satyanarayana is also a chief scientist. He made a place to test science tools. These tools help us listen to the Earth. He also...",
        "word_count": 100,
        "sentence_count": 20,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Two Smart Scientists Get a Big Award!**\n\nTwo scientists from a special science place are getting a big award. Their names are Labani Ray and H.V.S. Satyanarayana. They work at the CSIR-NGRI lab. This lab studies the Earth.\n\nLabani Ray is a very important scientist. She made a special lab. It is the only one like it in our country. This lab helps measure how hot rocks get. This helps us understand the Earth better.\n\nH.V.S. Satyanarayana is also a chief scientist. He made a place to test science tools. These tools help us listen to the Earth. He also helped build networks to watch for earthquakes. This helps keep people safe.\n\nThe Telangana Academy of Sciences is giving them this award. It is for their amazing science work. They are very good at what they do!",
        "word_count": 137,
        "sentence_count": 24,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:00.567564"
  },
  {
    "original": {
      "source": "The Hindu",
      "title": "T.N. government sets up 215 relief camps, 106 community kitchens in Chennai",
      "description": "",
      "url": "https://www.thehindu.com/news/national/tamil-nadu/tn-government-sets-up-215-relief-camps-106-community-kitchens-in-chennai/article70189144.ece",
      "published_date": "2025-10-22T10:38:49",
      "category": "national",
      "extraction_method": "rss",
      "raw_content": "The Tamil Nadu government has set up 215 relief camps and 106 community kitchens in Chennai and deployed a total of 24,149 personnel as part of Northeast monsoon relief and rescue operations. According to a press release, following the onset of the Northeast monsoon on October 16, Chief Minister M.K. Stalin has instructed all District Collectors to take safety measures to ensure that people were not affected by the heavy rain. He also chaired a review meeting on October 19 at the State Emergency Operations Centre in Chennai and ordered officials to speed up preparedness measures, safely evacuate people living in coastal and low-lying areas, and keep relief camps ready with essential facilities such as food, drinking water, and medical assistance. A total of 215 relief camps and 106 community kitchens had been established in Chennai. Currently 68 community kitchens have been made operational through which 1,46,950 people affected by the rain were provided breakfast on Wednesday, the press release said. The Integrated Command and Control Centre, which operates round the clock, has been taking immediate action on complaints received from the public through the helpline number, 1913. A total of 22,000 personnel from the Greater Chennai Corporation, including officers, engineers, and sanitation workers, along with 2,149 field staff from the Chennai Metropolitan Water Supply and Sewerage Board, were deployed for relief and rescue work, the release added. Published- October 22, 2025 04:08 pm IST disaster, accident and emergency incidentdisaster",
      "extracted_at": "2025-10-22T17:05:35.231797",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 240,
      "is_cleaned": true
    },
    "source": "The Hindu",
    "title": "T.N. government sets up 215 relief camps, 106 community kitchens in Chennai",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/tn-government-sets-up-215-relief-camps-106-community-kitchens-in-chennai/article70189144.ece",
    "published_date": "2025-10-22T10:38:49",
    "category": "national",
    "simplified_base": "**Chennai Gets Help After Big Rains!**\n\nBig rains came to Chennai. The government is helping people. They made 215 safe places to stay. These are called relief camps. They also made 106 kitchens. These are called community kitchens.\n\nLots of helpers are working. Almost 24,149 people are helping. They are helping with rain problems. The boss of the state, Chief Minister M.K. Stalin, is in charge. He told everyone to be safe. He wants to make sure people are okay.\n\nHe had a big meeting. He told helpers to get ready fast. People in low places or near the sea need to move. They are moved to safe places. The safe places have food and water. They also have doctors.\n\nRight now, 68 kitchens are open. They gave breakfast to many people. Over 146,000 people ate breakfast. This was on Wednesday.\n\nThere is a special center that is always open. It's called the Command and Control Centre. They listen to people's problems. You can call them on the phone. The number is 1913. They help right away.\n\nMany workers are helping. Over 22,000 workers are from the city. They are bosses, builders, and cleaners. More than 2,100 workers are from the water company. They are all helping with the rain.",
    "age_groups": {
      "group_1": {
        "text": "**Chennai Gets Help After Big Rains!** Big rains came to Chennai. The government is helping people. They made 215 safe places to stay. These are called relief camps. They also made 106 kitchens. These are called community kitchens. Lots of helpers are working. Almost 24,149 people are helping. They are...",
        "word_count": 50,
        "sentence_count": 10,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Chennai Gets Help After Big Rains!** Big rains came to Chennai. The government is helping people. They made 215 safe places to stay. These are called relief camps. They also made 106 kitchens. These are called community kitchens. Lots of helpers are working. Almost 24,149 people are helping. They are helping with rain problems. The boss of the state, Chief Minister M.K. Stalin, is in charge. He told everyone to be safe. He wants to make sure people are okay. He had a big meeting. He told helpers to get ready fast. People in low places or near the sea...",
        "word_count": 100,
        "sentence_count": 18,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Chennai Gets Help After Big Rains!** Big rains came to Chennai. The government is helping people. They made 215 safe places to stay. These are called relief camps. They also made 106 kitchens. These are called community kitchens. Lots of helpers are working. Almost 24,149 people are helping. They are helping with rain problems. The boss of the state, Chief Minister M.K. Stalin, is in charge. He told everyone to be safe. He wants to make sure people are okay. He had a big meeting. He told helpers to get ready fast. People in low places or near the sea need to move. They are moved to safe places. The safe places have food and water. They also have doctors. Right now, 68 kitchens are open. They gave breakfast to many people. Over 146,000 people ate breakfast. This was on Wednesday. There is a special center that is always open.",
        "word_count": 150,
        "sentence_count": 26,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:04.086324"
  },
  {
    "original": {
      "source": "Hindustan Times",
      "title": "IndiGo to operate Mumbai to Madinah direct flights daily from November 15",
      "description": "IndiGo on Wednesday announced that it will operate daily and direct flights between Mumbai and Saudi Arabia's Madinah, starting from November 15. The airline stated in an official release that it will",
      "url": "https://www.hindustantimes.com/india-news/indigo-to-operate-mumbai-to-madinah-direct-flights-daily-from-november-15-101761132188949.html",
      "published_date": "2025-10-22T17:05:41.067154",
      "category": "national",
      "extraction_method": "scraper",
      "raw_content": "IndiGo on Wednesday announced that it will operate daily and direct flights between Mumbai and Saudi Arabia's Madinah, starting from November 15. The airline stated in an official release that it will operate its Airbus A320 aircraft on this route, adding that flight bookings are now open on its website, mobile application, and across verified travel sites. This will be an addition to IndiGo's existing flights from Hyderabad to Madinah, which operate four times a week, and will be upgraded to a daily service starting November 16. Between India and the four cities in Saudi Arabia  Jeddah, Riyadh, Dammam, and Madinah  the airline operates more than 150 flights. IndiGo also announced its flight schedule between Mumbai and Madinah, effective from November 15. At present, IndiGo is the only Indian airline that flies direct to Madinah. During the Hajj season, several Indian pilgrims visit Madinah to offer prayers at the Prophet's Mosque. For this year's Hajj season, June 4 to June 9, 2025, the Ministry of Minority Affairs said that the Kingdom of Saudi Arabia allotted a quota of 1,75,025 1.75 lakh to India. Hajj is the annual Islamic pilgrimage to Mecca, which, while has its pre-listed dates, takes place depending on the sighting of the moon. The annual pilgrimage follows the path of Prophet Ibrahim and Prophet Muhammad, symbolising their devotion and submission to Allah. Millions of pilgrims undertake Hajj, including several from India.",
      "extracted_at": "2025-10-22T17:05:41.067154",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 234,
      "is_cleaned": true
    },
    "source": "Hindustan Times",
    "title": "IndiGo to operate Mumbai to Madinah direct flights daily from November 15",
    "url": "https://www.hindustantimes.com/india-news/indigo-to-operate-mumbai-to-madinah-direct-flights-daily-from-november-15-101761132188949.html",
    "published_date": "2025-10-22T17:05:41.067154",
    "category": "national",
    "simplified_base": "**New Flights to a Special City!**\n\nGuess what? A special airplane company called IndiGo is starting something new! They will fly planes from Mumbai, India, to a city called Madinah. Madinah is in a country called Saudi Arabia.\n\nThese new flights will start on November 15. You can fly on these planes every single day! The planes they will use are called Airbus A320. They are big and comfy.\n\nYou can already buy tickets for these flights. You can buy them on the IndiGo website or their app. You can also buy them from travel shops.\n\nIndiGo already flies to Madinah from another city. That city is called Hyderabad. Right now, those flights go four times a week. But starting November 16, they will also fly every day!\n\nIndiGo is a very busy airline. They fly to four cities in Saudi Arabia. These cities are Jeddah, Riyadh, Dammam, and Madinah. They fly over 150 flights to these places!\n\nIndiGo is the only airline from India that flies straight to Madinah. This is very special.\n\nMany people from India travel to Madinah. They go there to pray at a very important mosque. This mosque is called the Prophet's Mosque.\n\nThere is a special trip called Hajj. Many people go on this trip every year. It is a very important religious journey. It happens in a city called Mecca.\n\nThis year, Hajj will be from June 4 to June 9 in 2025. Saudi Arabia is letting 175,025 people from India go on Hajj.\n\nHajj is a special trip for Muslims. It follows the steps of important prophets. It shows how much they love and believe in God. Millions of people go on Hajj. Many of them are from India.",
    "age_groups": {
      "group_1": {
        "text": "**New Flights to a Special City!** Guess what? A special airplane company called IndiGo is starting something new! They will fly planes from Mumbai, India, to a city called Madinah. Madinah is in a country called Saudi Arabia. These new flights will start on November 15. You can fly on...",
        "word_count": 50,
        "sentence_count": 7,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**New Flights to a Special City!** Guess what? A special airplane company called IndiGo is starting something new! They will fly planes from Mumbai, India, to a city called Madinah. Madinah is in a country called Saudi Arabia. These new flights will start on November 15. You can fly on these planes every single day! The planes they will use are called Airbus A320. They are big and comfy. You can already buy tickets for these flights. You can buy them on the IndiGo website or their app. You can also buy them from travel shops. IndiGo already flies to...",
        "word_count": 100,
        "sentence_count": 13,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**New Flights to a Special City!** Guess what? A special airplane company called IndiGo is starting something new! They will fly planes from Mumbai, India, to a city called Madinah. Madinah is in a country called Saudi Arabia. These new flights will start on November 15. You can fly on these planes every single day! The planes they will use are called Airbus A320. They are big and comfy. You can already buy tickets for these flights. You can buy them on the IndiGo website or their app. You can also buy them from travel shops. IndiGo already flies to Madinah from another city. That city is called Hyderabad. Right now, those flights go four times a week. But starting November 16, they will also fly every day! IndiGo is a very busy airline. They fly to four cities in Saudi Arabia. These cities are Jeddah, Riyadh, Dammam, and Madinah.",
        "word_count": 150,
        "sentence_count": 19,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:07.860010"
  },
  {
    "original": {
      "source": "Hindustan Times",
      "title": "How did helipad collapse shortly after landing of President Murmu's helicopter?",
      "description": "Part of a helipad on which President Droupadi Murmu's helicopter landed in Kerala's Pathanamthitta collapsed shortly after the touchdown on Wednesday morning, necessitating the need for policemen and",
      "url": "https://www.hindustantimes.com/india-news/how-did-helipad-collapse-shortly-after-landing-of-president-droupadi-murmu-helicopter-in-kerala-101761129436901.html",
      "published_date": "2025-10-22T17:05:43.624013",
      "category": "national",
      "extraction_method": "scraper",
      "raw_content": "Part of a helipad on which President Droupadi Murmu's helicopter landed in Kerala's Pathanamthitta collapsed shortly after the touchdown on Wednesday morning, necessitating the need for policemen and other personnel to push the chopper's wheels out of the caved in portion. The chopper,carrying President Droupadi Murmu, had landed at the Rajiv Gandhi Indoor Stadium in Pathanamthitta's Pramadam for her Sabarimala visit. A senior police officer of the district said that the decision to land President Murmu's helicopter at the Rajiv Gandhi stadium was made at the last moment, after which the helipad was created there late on Tuesday, according to PTI news agency. The landing was originally planned at Nilackal near Pamba, but it was changed to Pramadam due to inclement weather. The concrete of the helipad at the Rajiv Gandhi Indoor Stadium had not set as it was built overnight, the officer said. \"The concrete had not set completely and therefore, it could not handle the helicopter's weight when it landed and depressions were formed where the wheels touched the ground,\" PTI quoted the officer. After the President left for Pamba by road, several policemen and fire force personnel were seen pushing the helicopter's wheels out of the small depressions created when it landed on the concrete. The President landed in Thiruvananthapuram on Tuesday evening for her four-day official Kerala visit. She left on Wednesday morning for Pathanamthitta district, where the hill shrine of Sabarimala is located. From Pramadam, Murmu left for Pamba, the foothills of Sabarimala, via road.",
      "extracted_at": "2025-10-22T17:05:43.624013",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 250,
      "is_cleaned": true
    },
    "source": "Hindustan Times",
    "title": "How did helipad collapse shortly after landing of President Murmu's helicopter?",
    "url": "https://www.hindustantimes.com/india-news/how-did-helipad-collapse-shortly-after-landing-of-president-droupadi-murmu-helicopter-in-kerala-101761129436901.html",
    "published_date": "2025-10-22T17:05:43.624013",
    "category": "national",
    "simplified_base": "**President's Helicopter Lands on a Wobbly Pad!**\n\nGuess what happened to our President, Droupadi Murmu? Her helicopter landed in a place called Pathanamthitta. It was a special landing spot for helicopters, called a helipad.\n\nBut here's the funny part! Right after her helicopter landed, a piece of the helipad broke. Oh no! It was like a little hole appeared where the helicopter wheels were.\n\nSo, some brave police officers and helpers had to push the helicopter. They helped the wheels get out of the wobbly spot. Phew!\n\nThe President was going to visit a famous temple called Sabarimala. Her helicopter was supposed to land somewhere else. But the weather was not good. It was raining and windy.\n\nSo, they had to change the landing spot very quickly. They made a new helipad at a stadium. It was called the Rajiv Gandhi Indoor Stadium.\n\nThis new helipad was made very fast. They built it the night before. The cement they used was still a little wet. It had not dried all the way.\n\nWhen the big helicopter landed, it was too heavy for the wet cement. The wheels made little dents in the ground. That's why the helipad broke a little.\n\nAfter the President went to visit the temple, people saw the helicopter. They saw the little holes. Then, the police and firefighters helped push the helicopter out.\n\nThe President had arrived in Kerala the day before. She was visiting for a few days. She flew to Pathanamthitta in the morning.\n\nThen, she traveled by car to a place called Pamba. Pamba is at the bottom of the hill where the temple is. It was an exciting day!",
    "age_groups": {
      "group_1": {
        "text": "**President's Helicopter Lands on a Wobbly Pad!** Guess what happened to our President, Droupadi Murmu? Her helicopter landed in a place called Pathanamthitta. It was a special landing spot for helicopters, called a helipad. But here's the funny part! Right after her helicopter landed, a piece of the helipad broke.",
        "word_count": 50,
        "sentence_count": 6,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**President's Helicopter Lands on a Wobbly Pad!** Guess what happened to our President, Droupadi Murmu? Her helicopter landed in a place called Pathanamthitta. It was a special landing spot for helicopters, called a helipad. But here's the funny part! Right after her helicopter landed, a piece of the helipad broke. Oh no! It was like a little hole appeared where the helicopter wheels were. So, some brave police officers and helpers had to push the helicopter. They helped the wheels get out of the wobbly spot. Phew! The President was going to visit a famous temple called Sabarimala. Her helicopter...",
        "word_count": 100,
        "sentence_count": 13,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**President's Helicopter Lands on a Wobbly Pad!** Guess what happened to our President, Droupadi Murmu? Her helicopter landed in a place called Pathanamthitta. It was a special landing spot for helicopters, called a helipad. But here's the funny part! Right after her helicopter landed, a piece of the helipad broke. Oh no! It was like a little hole appeared where the helicopter wheels were. So, some brave police officers and helpers had to push the helicopter. They helped the wheels get out of the wobbly spot. Phew! The President was going to visit a famous temple called Sabarimala. Her helicopter was supposed to land somewhere else. But the weather was not good. It was raining and windy. So, they had to change the landing spot very quickly. They made a new helipad at a stadium. It was called the Rajiv Gandhi Indoor Stadium. This new helipad was made very fast.",
        "word_count": 150,
        "sentence_count": 19,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:11.547717"
  },
  {
    "original": {
      "source": "Hindustan Times",
      "title": "Provisions of the SCST Act can't be used to curtail bank's mortgage rights: Delhi HC",
      "description": "New Delhi, The Delhi High Court has said that the provisions of the SCST Act relating to wrongful occupation or dispossession of land belonging to people from Scheduled Castes and Scheduled Tribes ca",
      "url": "https://www.hindustantimes.com/india-news/provisions-of-the-sc-st-act-can-t-be-used-to-curtail-bank-s-mortgage-rights-delhi-hc-101761129533297.html",
      "published_date": "2025-10-22T17:05:46.396544",
      "category": "national",
      "extraction_method": "scraper",
      "raw_content": "New Delhi, The Delhi High Court has said that the provisions of the SCST Act relating to wrongful occupation or dispossession of land belonging to people from Scheduled Castes and Scheduled Tribes cannot be used to prevent a bank from exercising its lawful mortgage rights. Justice Sachin Datta made the prima facie observation while staying the proceedings initiated by the National Commission for Scheduled Tribes against Axis Bank, its Managing Director and the Chief Executive Officer . \"Prima facie, in the context of the facts of the present case, Sections 3 and of the Atrocities Act are not attracted inasmuch the same cannot be invoked to preclude prevent the exercise of mortgage rightsecurity interest of the petitioner,\" the judge said in an order passed on October 16. The Commission had ordered Axis Bank's MD and CEO to appear in person after a representation was made by a person alleging violation under Sections 3 and of the Scheduled Castes and Scheduled Tribes Act . Section 3 penalises wrongfully occupation or cultivation of land belonging to a member of the SCST community, while Section 3 relates to the punishment of wrongful dispossession of a member of the SCST community of his land or premises. According to the petition before the court, a credit facility of16.69 crore was sanctioned by Axis Bank to Sundev Appliances Ltd, secured by a mortgaged property in Maharashtra's Vasai, in 2013. After the borrower defaulted, the account was declared a non-performing asset in 2017, prompting the bank to invoke its rights under the law, which was followed by a civil dispute over ownership of the mortgaged property. One of the persons involved in the dispute, thereafter, approached the National Commission for Scheduled Tribes. The high court stayed the order saying the proceedings pending before the Commission were without jurisdiction. \"The proceedings pending before respondent no.1 , particularly, the summons issued therein which requires the MD  CEO of the pe",
      "extracted_at": "2025-10-22T17:05:46.396544",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 321,
      "is_cleaned": true
    },
    "source": "Hindustan Times",
    "title": "Provisions of the SCST Act can't be used to curtail bank's mortgage rights: Delhi HC",
    "url": "https://www.hindustantimes.com/india-news/provisions-of-the-sc-st-act-can-t-be-used-to-curtail-bank-s-mortgage-rights-delhi-hc-101761129533297.html",
    "published_date": "2025-10-22T17:05:46.396544",
    "category": "national",
    "simplified_base": "**Bank Can Still Get Its Money Back!**\n\nImagine a bank lends money to someone. That person promises to give back the money. They also say a special piece of land can be used if they can't pay. This is called a mortgage.\n\nA big court in Delhi heard a case. It was about a bank called Axis Bank. Someone said the bank did something wrong. They said the bank broke a special law. This law helps people from certain communities.\n\nThe special law is about not taking land unfairly. It's about not kicking people off their land when they shouldn't be.\n\nBut the judge said something important. He said this special law can't stop the bank. The bank has a right to get its money back. The bank can use the land if the person doesn't pay.\n\nThe judge stopped the special investigation. He said it wasn't the right place for this problem.\n\nAxis Bank had lent a lot of money. It was for a company called Sundev Appliances. The company promised a piece of land. This land was in a place called Vasai.\n\nThe company didn't pay the bank back. So, the bank wanted to use the land. Then, there was a fight about who owned the land.\n\nSomeone involved in the fight told the special commission. They said the bank did something wrong.\n\nThe judge said the commission shouldn't be involved. The bank has its rights. The special law is for different problems. The bank can still get its money.",
    "age_groups": {
      "group_1": {
        "text": "**Bank Can Still Get Its Money Back!** Imagine a bank lends money to someone. That person promises to give back the money. They also say a special piece of land can be used if they can't pay. This is called a mortgage. A big court in Delhi heard a case.",
        "word_count": 50,
        "sentence_count": 6,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Bank Can Still Get Its Money Back!** Imagine a bank lends money to someone. That person promises to give back the money. They also say a special piece of land can be used if they can't pay. This is called a mortgage. A big court in Delhi heard a case. It was about a bank called Axis Bank. Someone said the bank did something wrong. They said the bank broke a special law. This law helps people from certain communities. The special law is about not taking land unfairly. It's about not kicking people off their land when they shouldn't...",
        "word_count": 100,
        "sentence_count": 12,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Bank Can Still Get Its Money Back!** Imagine a bank lends money to someone. That person promises to give back the money. They also say a special piece of land can be used if they can't pay. This is called a mortgage. A big court in Delhi heard a case. It was about a bank called Axis Bank. Someone said the bank did something wrong. They said the bank broke a special law. This law helps people from certain communities. The special law is about not taking land unfairly. It's about not kicking people off their land when they shouldn't be. But the judge said something important. He said this special law can't stop the bank. The bank has a right to get its money back. The bank can use the land if the person doesn't pay. The judge stopped the special investigation. He said it wasn't the right place...",
        "word_count": 150,
        "sentence_count": 18,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:15.138962"
  },
  {
    "original": {
      "source": "Hindustan Times",
      "title": "SC seeks Centre's assistance on PIL seeking nationwide ban on online gambling",
      "description": "New Delhi, The Supreme Court has sought the Centre's assistance on a plea seeking directions to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sp",
      "url": "https://www.hindustantimes.com/india-news/sc-seeks-centre-s-assistance-on-pil-seeking-nationwide-ban-on-online-gambling-101761129168055.html",
      "published_date": "2025-10-22T17:05:47.688175",
      "category": "national",
      "extraction_method": "scraper",
      "raw_content": "New Delhi, The Supreme Court has sought the Centre's assistance on a plea seeking directions to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sports games. A bench of justices JB Pardiwala and KV Viswanathan asked the counsel appearing for the petitioner to serve a copy of the PIL to the counsel for the central government. \"We request VC Bharathi to look into the petition and assist us on the next date of hearing. List after two weeks,\" the bench said in an order passed on Friday. The top court was hearing a plea filed by think tank Centre for Accountability and Systemic Change seeking directions to the Centre to prohibit online gambling and betting platforms that allegedly operate under the guise of social and e-sports games. The plea has also sought directions to the RBI, NPCI, and UPI platforms to disallow any monetary transactions involving unregistered gaming applications. It has sought tax recovery and investigation through Interpol, CBI, and ED against offshore gaming companies, which are estimated to owe over2 lakh crore in unpaid taxes. The plea has sought a direction to Union ministries of Electronics and Information Technology, Information and Broadcasting, Finance and Youth Affairs and Sports to do a harmonious interpretation of provisions of the Promotion and Regulation of Online Gaming Act, 2025, and laws made by state legislatures to prohibit online gambling and betting games operating in the guise of social and e-sports games. The Act lays down a comprehensive framework to promote safe digital recreation while prohibiting harmful practices linked to online money games. The petition names six respondents, including four Union ministries and the two leading app store operators, Apple Inc. and Google India Pvt. Ltd. The CASC has urged the top court to direct the government to clamp down on the proliferation of betting and gambling applications, which they claim are inflicting widespread social and",
      "extracted_at": "2025-10-22T17:05:47.688175",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 319,
      "is_cleaned": true
    },
    "source": "Hindustan Times",
    "title": "SC seeks Centre's assistance on PIL seeking nationwide ban on online gambling",
    "url": "https://www.hindustantimes.com/india-news/sc-seeks-centre-s-assistance-on-pil-seeking-nationwide-ban-on-online-gambling-101761129168055.html",
    "published_date": "2025-10-22T17:05:47.688175",
    "category": "national",
    "simplified_base": "**Kids, Let's Talk About Games!**\n\nImagine playing fun games on your tablet or computer. Sometimes, these games can be tricky. Some games look like regular games. But they might be hiding something else. They might be like gambling. Gambling means betting money.\n\nA very important court in India is looking into this. It's called the Supreme Court. They want to make sure games are safe for everyone. A group called CASC is worried. They think some online games are like gambling. They want to stop these games.\n\nThe Supreme Court asked the government for help. They want the government to look at this problem. A lawyer told the court about the petition. The court said they will think about it. They will talk about it again in two weeks.\n\nThe CASC group wants to stop online gambling. They say some games pretend to be social games. Or they pretend to be e-sports games. E-sports are like video game competitions.\n\nThe group also wants to stop money from going to these games. They asked the bank and payment people to help. They don't want money to go to games that are not allowed.\n\nThey also think some companies owe a lot of money in taxes. These companies are from other countries. The group wants the government to find out. They want to get the money back.\n\nThe petition asks different government groups to work together. They want them to understand the rules. They want to stop online gambling games. These games hide as fun games.\n\nThere is a new law about online games. It is called the Promotion and Regulation of Online Gaming Act, 2025. This law helps make games safe. It stops harmful money games.\n\nThe petition names some companies. It names four government groups. It also names the companies that have app stores. These are Apple and Google.\n\nThe CASC group wants the court to tell the government to stop these games. They say these games are causing problems. They are hurting people in many ways.",
    "age_groups": {
      "group_1": {
        "text": "**Kids, Let's Talk About Games!** Imagine playing fun games on your tablet or computer. Sometimes, these games can be tricky. Some games look like regular games. But they might be hiding something else. They might be like gambling. Gambling means betting money. A very important court in India is looking...",
        "word_count": 50,
        "sentence_count": 8,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Kids, Let's Talk About Games!** Imagine playing fun games on your tablet or computer. Sometimes, these games can be tricky. Some games look like regular games. But they might be hiding something else. They might be like gambling. Gambling means betting money. A very important court in India is looking into this. It's called the Supreme Court. They want to make sure games are safe for everyone. A group called CASC is worried. They think some online games are like gambling. They want to stop these games. The Supreme Court asked the government for help. They want the government to...",
        "word_count": 100,
        "sentence_count": 15,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Kids, Let's Talk About Games!** Imagine playing fun games on your tablet or computer. Sometimes, these games can be tricky. Some games look like regular games. But they might be hiding something else. They might be like gambling. Gambling means betting money. A very important court in India is looking into this. It's called the Supreme Court. They want to make sure games are safe for everyone. A group called CASC is worried. They think some online games are like gambling. They want to stop these games. The Supreme Court asked the government for help. They want the government to look at this problem. A lawyer told the court about the petition. The court said they will think about it. They will talk about it again in two weeks. The CASC group wants to stop online gambling. They say some games pretend to be social games. Or they pretend to...",
        "word_count": 150,
        "sentence_count": 21,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:18.919489"
  },
  {
    "original": {
      "source": "Hindustan Times",
      "title": "SC goes extra mile to ensure widow gets Railways' compensation after 23 years of legal battle",
      "description": "New Delhi, For a tragedy-struck widow, who lost her husband in a train accident in 2002, the Supreme Court went the extra mile to ensure that she is duly compensated by the Railways after years of str",
      "url": "https://www.hindustantimes.com/india-news/sc-goes-extra-mile-to-ensure-widow-gets-railways-compensation-after-23-years-of-legal-battle-101761128067548.html",
      "published_date": "2025-10-22T17:05:49.052633",
      "category": "national",
      "extraction_method": "scraper",
      "raw_content": "New Delhi, For a tragedy-struck widow, who lost her husband in a train accident in 2002, the Supreme Court went the extra mile to ensure that she is duly compensated by the Railways after years of struggle. Saynokta Devi's husband Vijay Singh had a valid railway ticket from Bakhtiyarpur station to go to Patna by the Bhagalpur-Danapur Intercity Express on March 21, 2002, but he accidentally fell down from the running train at the originating station itself, due to heavy rush inside the compartment and died instantly. What followed was a legal battle for next two decades, as Devi's claim for compensation was turned down by the Railway Claims Tribunal and the Patna High Court on the ground that the deceased was of unsound mind. Aggrieved by the high court's order denying her claim, she, through her lawyer Fauzia Shakil, approached the apex court. The Supreme Court in 2023 rejected the reasoning given by the Railway Claims Tribunal and the Patna High Court and set aside the orders terming them \"completely absurd\", \"imaginary\" and \"contrary to the undisputed facts on record\". \"What emerges is the fact that the appellant's claim was not accepted by both the Tribunal and the High Court solely on the ground that the deceased was of unsound mind and he was knocked down by an unidentified train,\" the top court had noted in its order of February 2, 2023. A bench headed by Justice Surya Kant had observed that if the deceased would have been of unsound mind, it would have been nearly impossible for him to purchase a valid railway ticket for travel to Patna and could not have tried to board the train all by himself. The top court directed the Railways to pay the widow within two months a compensation of4 lakh with six per cent interest per annum from the date of filing of the claim petition. But to her bad luck, her local counsel could not convey her the order as he passed away. The railways on other hand tried to comply with the order and wrote different letters to Devi but c",
      "extracted_at": "2025-10-22T17:05:49.052633",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 352,
      "is_cleaned": true
    },
    "source": "Hindustan Times",
    "title": "SC goes extra mile to ensure widow gets Railways' compensation after 23 years of legal battle",
    "url": "https://www.hindustantimes.com/india-news/sc-goes-extra-mile-to-ensure-widow-gets-railways-compensation-after-23-years-of-legal-battle-101761128067548.html",
    "published_date": "2025-10-22T17:05:49.052633",
    "category": "national",
    "simplified_base": "**A Long Wait for Justice**\n\nImagine a sad story about a lady named Saynokta Devi. Her husband, Vijay Singh, was on a train. It was March 21, 2002. He had a ticket to go to Patna. The train was very crowded. Sadly, Vijay fell from the train. He passed away right away.\n\nThis happened a long, long time ago. Saynokta wanted help. She asked for money from the train company. But the train company said no. They said Vijay was not thinking clearly. A special court also said no.\n\nSaynokta did not give up. She went to the highest court in the land. This court is called the Supreme Court. She told her story to the judges. The judges listened carefully.\n\nThe Supreme Court looked at everything. They said the train company was wrong. They said it was silly to think Vijay was not thinking clearly. How could he buy a ticket if he wasn't thinking? How could he get on the train by himself?\n\nThe Supreme Court said the train company must pay Saynokta. They said she should get money. It was a lot of money, 4 lakh rupees. They also said she should get a little extra money each year.\n\nBut there was another problem. The person who helped Saynokta with her case passed away. So, she didn't know about the good news. The train company tried to tell her. They sent her letters. But it was hard to get the message to her.\n\nThe Supreme Court wanted to make sure Saynokta got her money. They wanted to help her after waiting for so many years. It took 23 years for her to get justice. But finally, the Supreme Court made sure she would be paid.",
    "age_groups": {
      "group_1": {
        "text": "**A Long Wait for Justice** Imagine a sad story about a lady named Saynokta Devi. Her husband, Vijay Singh, was on a train. It was March 21, 2002. He had a ticket to go to Patna. The train was very crowded. Sadly, Vijay fell from the train. He passed away...",
        "word_count": 50,
        "sentence_count": 7,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**A Long Wait for Justice** Imagine a sad story about a lady named Saynokta Devi. Her husband, Vijay Singh, was on a train. It was March 21, 2002. He had a ticket to go to Patna. The train was very crowded. Sadly, Vijay fell from the train. He passed away right away. This happened a long, long time ago. Saynokta wanted help. She asked for money from the train company. But the train company said no. They said Vijay was not thinking clearly. A special court also said no. Saynokta did not give up. She went to the highest court...",
        "word_count": 100,
        "sentence_count": 15,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**A Long Wait for Justice** Imagine a sad story about a lady named Saynokta Devi. Her husband, Vijay Singh, was on a train. It was March 21, 2002. He had a ticket to go to Patna. The train was very crowded. Sadly, Vijay fell from the train. He passed away right away. This happened a long, long time ago. Saynokta wanted help. She asked for money from the train company. But the train company said no. They said Vijay was not thinking clearly. A special court also said no. Saynokta did not give up. She went to the highest court in the land. This court is called the Supreme Court. She told her story to the judges. The judges listened carefully. The Supreme Court looked at everything. They said the train company was wrong. They said it was silly to think Vijay was not thinking clearly. How could he buy...",
        "word_count": 150,
        "sentence_count": 22,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:22.702961"
  },
  {
    "original": {
      "source": "Hindustan Times",
      "title": "Govt releases draft amendments to regulate AI or synthetically-generated info",
      "description": "The ministry of electronics and information technology MeitY has released draft amendments to the Information Technology Intermediary Guidelines and Digital Media Ethics Code Rules, 2021, introduc",
      "url": "https://www.hindustantimes.com/india-news/govt-releases-draft-amendments-to-regulate-ai-or-synthetically-generated-info-101761126663943.html",
      "published_date": "2025-10-22T17:05:51.697134",
      "category": "national",
      "extraction_method": "scraper",
      "raw_content": "The ministry of electronics and information technology MeitY has released draft amendments to the Information Technology Intermediary Guidelines and Digital Media Ethics Code Rules, 2021, introducing a framework to identify and regulate AI-generated or synthetically-generated information. It has invited public feedback on the amendments by November 6. The definition of synthetically generated information is a key proposed change. It has been described as any information artificially or algorithmically created, generated, modified or altered using a computer resource in a manner that appears reasonably authentic or true. With this definition, the government seeks to bring AI-generated content under the due diligence and takedown obligations applicable to unlawful online information. The draft amendments make labelling and traceability mandatory for synthetic content. Intermediaries offering tools that create or modify digital media are required to ensure such information carries a visible or audible label or an embedded permanent metadata identifier that clearly marks it as AI-generated. For images or videos, the label must cover at least 10 of the surface area. For audio, it must be played during the first 10 of its duration. Intermediaries will be prohibited from suppressing or removing such identifiers, making it difficult to disguise the origin of AI-generated content. For large social media platforms, referred to as significant social media intermediaries, the obligations are more elaborate. These companies will be required to ask users to declare whether their uploaded content is synthetically-generated before publication. They must also deploy reasonable and proportionate technical measures like automated detection systems to verify the same. Verified or declared synthetic content must be clearly labelled or accompanied by a visible notice, allowing users to distinguish authentic media from manipulated material. Failure to comply could expose these",
      "extracted_at": "2025-10-22T17:05:51.697134",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 282,
      "is_cleaned": true
    },
    "source": "Hindustan Times",
    "title": "Govt releases draft amendments to regulate AI or synthetically-generated info",
    "url": "https://www.hindustantimes.com/india-news/govt-releases-draft-amendments-to-regulate-ai-or-synthetically-generated-info-101761126663943.html",
    "published_date": "2025-10-22T17:05:51.697134",
    "category": "national",
    "simplified_base": "**New Rules for Computer-Made Pictures and Stories!**\n\nImagine a computer making a picture or a story that looks totally real. Sometimes, these are made by something called AI. AI is like a super-smart computer brain.\n\nNow, the government wants to make sure we know when something is made by a computer. They have made some new rules. These rules are like a guide for websites and apps.\n\nThey want to call computer-made stuff \"synthetically generated information.\" That means it's made in a special way by computers. It looks like it could be real, but it's not.\n\nThe government wants these computer-made things to be treated carefully. Just like other online stuff that isn't allowed.\n\nSo, here's what will happen. Computer-made pictures, stories, and sounds must have a special label. This label will tell you it's made by AI.\n\nIf it's a picture or a video, the label must be easy to see. It will cover a big part of the picture. If it's a sound, the label will play at the beginning.\n\nWebsites and apps that help make these things can't hide the label. They can't take it off. This way, we'll always know where it came from.\n\nBig websites and apps have extra rules. They have to ask people if their pictures or stories are made by AI. They need to check if it's true.\n\nThen, they must show a clear label. This helps everyone know what's real and what's made by a computer. It's important to know the difference!",
    "age_groups": {
      "group_1": {
        "text": "**New Rules for Computer-Made Pictures and Stories!** Imagine a computer making a picture or a story that looks totally real. Sometimes, these are made by something called AI. AI is like a super-smart computer brain. Now, the government wants to make sure we know when something is made by a...",
        "word_count": 50,
        "sentence_count": 5,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**New Rules for Computer-Made Pictures and Stories!** Imagine a computer making a picture or a story that looks totally real. Sometimes, these are made by something called AI. AI is like a super-smart computer brain. Now, the government wants to make sure we know when something is made by a computer. They have made some new rules. These rules are like a guide for websites and apps. They want to call computer-made stuff \"synthetically generated information.\" That means it's made in a special way by computers. It looks like it could be real, but it's not. The government wants these...",
        "word_count": 100,
        "sentence_count": 11,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**New Rules for Computer-Made Pictures and Stories!** Imagine a computer making a picture or a story that looks totally real. Sometimes, these are made by something called AI. AI is like a super-smart computer brain. Now, the government wants to make sure we know when something is made by a computer. They have made some new rules. These rules are like a guide for websites and apps. They want to call computer-made stuff \"synthetically generated information.\" That means it's made in a special way by computers. It looks like it could be real, but it's not. The government wants these computer-made things to be treated carefully. Just like other online stuff that isn't allowed. So, here's what will happen. Computer-made pictures, stories, and sounds must have a special label. This label will tell you it's made by AI. If it's a picture or a video, the label must be easy...",
        "word_count": 150,
        "sentence_count": 16,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:26.370687"
  },
  {
    "original": {
      "source": "Indian Express",
      "title": "Amid seat-sharing tensions, Tejashwis new promises  permanent jobs for jeevikas, womens welfare schemes  India News - The Indian Express",
      "description": "At a press conference, Bihar's Leader of Opposition Tejashwi Yadav dismissed rumours of friction between his RJD and the Congress. , At a press conference, Bihar's Leader of Opposition Tejashwi Yadav dismissed rumours of friction between his RJD and the Congress.",
      "url": "https://indianexpress.com/article/india/seat-sharing-tejashwi-yadav-jobs-for-jeevika-women-welfare-schemes-10320693/",
      "published_date": "2025-10-22T15:57:04+05:30",
      "category": "national",
      "extraction_method": "firecrawl",
      "raw_content": "Amid seat-sharing tensions, Tejashwis new promises  permanent jobs for jeevikas, womens welfare schemes At a press conference, Bihar's Leader of Opposition Tejashwi Yadav dismissed rumours of friction between his RJD and the Congress. PatnaOctober 22, 2025 03:57 PM IST First published on: Oct 22, 2025 at 03:56 PM IST - !share-btnhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesiconly-regular-outline-send.svg Share - !comment-btnhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesiconly-regular-outline-chat.svg Comments - !prrint-btnhttps:indianexpress.comwp-contentthemesindianexpressimagesprint.svg Print - !google-preferred-btnhttps:images.indianexpress.com202508Google-button-2.gifhttps:www.google.compreferencessource?qindianexpress.com Offering job permanence to Bihars two-lakh Jeevika community mobilisers and an equal number of contractual employees, ensuring education and employment for girls, and providing houses, adequate ration and incomes for women  these are among the Mahagathbandhans new promises that the states Leader of Opposition Tejashwi Yadav has made in the run-up to the assembly elections. He also dismissed rumours of friction within the alliance over seat-sharing. At a press conference Wednesday, Yadav, who is leading the Rashtriya Janata Dalhttps:indianexpress.comaboutrashtriya-janata-dals election campaign in the state, announced a series of measures for Jeevika didis  the women associated with the state governments World Bank-aided Bihar Rural Livelihoods Project BRLP for the social and economic empowerment of the rural poor, also known as Jeevika. This includes interest-free loans for two years. The state currently has about 1.4 crore Jeevika workers from about 11 lakh self-help groups SHGs of women. Advertisement Community mobiliser CM didis bear the burden of so many responsibilities. We would offer them permanent jobs fo",
      "extracted_at": "2025-10-22T17:06:16.185453",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 224,
      "is_cleaned": true
    },
    "source": "Indian Express",
    "title": "Amid seat-sharing tensions, Tejashwis new promises  permanent jobs for jeevikas, womens welfare schemes  India News - The Indian Express",
    "url": "https://indianexpress.com/article/india/seat-sharing-tejashwi-yadav-jobs-for-jeevika-women-welfare-schemes-10320693/",
    "published_date": "2025-10-22T15:57:04+05:30",
    "category": "national",
    "simplified_base": "**Tejashwi Makes Big Promises for Bihar!**\n\nTejashwi Yadav is a leader in Bihar. He talked to reporters. Some people thought his party and another party were arguing. Tejashwi said that is not true. They are friends.\n\nTejashwi made some exciting new promises. He wants to help many women in Bihar. He wants to give jobs to \"Jeevika\" women. These women help their communities. Tejashwi said they will get permanent jobs. This means they will have jobs for a long time.\n\nHe also promised jobs for other workers. These workers have temporary jobs now. Tejashwi wants them to have permanent jobs too.\n\nHe wants to help girls get education. He also wants them to find good jobs. Tejashwi said women will get houses. They will get enough food to eat. They will also have good incomes.\n\nThese promises are for the upcoming elections. Tejashwi is leading a team called the Mahagathbandhan.\n\nHe talked about \"Jeevika didis.\" These are women who are part of a special project. The project helps poor people in villages. It helps them become stronger.\n\nTejashwi said Jeevika didis will get special help. They will get loans that do not cost any money for two years.\n\nThere are many Jeevika workers in Bihar. They are in groups. These groups help women work together.\n\nTejashwi said the community helpers have many jobs. He wants to give them permanent jobs.",
    "age_groups": {
      "group_1": {
        "text": "**Tejashwi Makes Big Promises for Bihar!** Tejashwi Yadav is a leader in Bihar. He talked to reporters. Some people thought his party and another party were arguing. Tejashwi said that is not true. They are friends. Tejashwi made some exciting new promises. He wants to help many women in Bihar.",
        "word_count": 50,
        "sentence_count": 8,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**Tejashwi Makes Big Promises for Bihar!** Tejashwi Yadav is a leader in Bihar. He talked to reporters. Some people thought his party and another party were arguing. Tejashwi said that is not true. They are friends. Tejashwi made some exciting new promises. He wants to help many women in Bihar. He wants to give jobs to \"Jeevika\" women. These women help their communities. Tejashwi said they will get permanent jobs. This means they will have jobs for a long time. He also promised jobs for other workers. These workers have temporary jobs now. Tejashwi wants them to have permanent jobs...",
        "word_count": 100,
        "sentence_count": 15,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**Tejashwi Makes Big Promises for Bihar!** Tejashwi Yadav is a leader in Bihar. He talked to reporters. Some people thought his party and another party were arguing. Tejashwi said that is not true. They are friends. Tejashwi made some exciting new promises. He wants to help many women in Bihar. He wants to give jobs to \"Jeevika\" women. These women help their communities. Tejashwi said they will get permanent jobs. This means they will have jobs for a long time. He also promised jobs for other workers. These workers have temporary jobs now. Tejashwi wants them to have permanent jobs too. He wants to help girls get education. He also wants them to find good jobs. Tejashwi said women will get houses. They will get enough food to eat. They will also have good incomes. These promises are for the upcoming elections. Tejashwi is leading a team called the Mahagathbandhan.",
        "word_count": 150,
        "sentence_count": 22,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:29.684287"
  },
  {
    "original": {
      "source": "Indian Express",
      "title": "Prof Eknath Chitnis, veteran scientist who pioneered Indias space programme, dies at 100",
      "description": "Veteran space scientist Professor Eknath Vasant Chitnis, instrumental in India's space program and ISRO's founding, passed away in Pune at 100. His legacy includes the historic Satellite Instructional Television Experiment that revolutionized education in India, Eknath Chitnis was handpicked by Vikram Sarabhai to develop the countrys space programme and played a key role in establishing the Indian Space Research Organisation Isro.",
      "url": "https://indianexpress.com/article/india/prof-eknath-chitnis-veteran-scientist-pioneered-india-space-programme-dies-10320275/",
      "published_date": "2025-10-22T12:46:31+05:30",
      "category": "national",
      "extraction_method": "firecrawl",
      "raw_content": "Advertisement Prof Eknath Chitnis, veteran scientist who pioneered Indias space programme, dies at 100 Eknath Chitnis was handpicked by Vikram Sarabhai to develop the countrys space programme and played a key role in establishing the Indian Space Research Organisation Isro. Written by Anjali Mararhttps:indianexpress.comprofileauthoranjali-marar Bengaluru  Updated: October 22, 2025 12:46 PM IST _!whatsapphttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-wapp-share.svg_ Whatsapp _!twitterhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagestwitter-preferred.svg_ twitter _!facebookhttps:indianexpress.comwp-contentthemesindianexpressimagesopinionimagesicon-fb-share.svg_ Facebook _!Reddithttps:indianexpress.comwp-contentthemesindianexpressimagesblack-icon-reddit.svg_ Reddit Veteran space scientist Professor Eknath Vasant Chitnis passed away in Pune on Wednesday. He was 100. Among the pioneers of the countrys space programme, Chitnis had played a key role in establishing the Indian Space Research Organisation  Isrohttps:indianexpress.comaboutisro. His last rites will be performed in Punehttps:indianexpress.comsectioncitiespune on Wednesday afternoon. Handpicked by Vikram Sarabhai, the father of Indias space programme, Chitnis was known to be his right-hand man and led a team that scouted for a launchpad, before zeroing down on Thumba in Thiruvananthapuram, and later Sriharikota along the coast of Andhra Pradesh. Story continues below this ad Chitnis had retired as the director of the Space Application Centre in Ahmedabadhttps:indianexpress.comsectioncitiesahmedabad in the mid-1980s, following which he, along with his wife, the late Kumud Chitnis, settled in Pune. His most significant contribution came through the Satellite Instructional Television Experiment SITE in 1975-76, which he directed. This project conducted educational p",
      "extracted_at": "2025-10-22T17:07:21.261963",
      "cleaned_at": "2025-10-22T17:07:41.966328",
      "word_count": 209,
      "is_cleaned": true
    },
    "source": "Indian Express",
    "title": "Prof Eknath Chitnis, veteran scientist who pioneered Indias space programme, dies at 100",
    "url": "https://indianexpress.com/article/india/prof-eknath-chitnis-veteran-scientist-pioneered-india-space-programme-dies-10320275/",
    "published_date": "2025-10-22T12:46:31+05:30",
    "category": "national",
    "simplified_base": "**A Star Scientist Says Goodbye**\n\nProfessor Eknath Chitnis was a very smart scientist. He helped India explore space. He was 100 years old. He passed away in a city called Pune.\n\nProfessor Chitnis was one of the first people to help India's space program. He was very important in starting ISRO. ISRO is the Indian Space Research Organisation.\n\nA man named Vikram Sarabhai picked Professor Chitnis. Vikram Sarabhai was like the dad of India's space program. Professor Chitnis was his special helper.\n\nProfessor Chitnis helped find places for rockets to launch. They looked for a good spot near the sea. They found a place called Thumba. Later, they found another place called Sriharikota.\n\nProfessor Chitnis was the boss of a special center. This center helped use space for learning. It was called the Space Application Centre. He led a big project called SITE.\n\nSITE used TV from space to teach people. This happened a long time ago, in 1975 and 1976. It was a very important project.\n\nProfessor Chitnis retired many years ago. He lived in Pune with his wife. Now, he is gone, but his work in space will be remembered.",
    "age_groups": {
      "group_1": {
        "text": "**A Star Scientist Says Goodbye** Professor Eknath Chitnis was a very smart scientist. He helped India explore space. He was 100 years old. He passed away in a city called Pune. Professor Chitnis was one of the first people to help India's space program. He was very important in starting...",
        "word_count": 50,
        "sentence_count": 6,
        "complexity_level": "very_simple",
        "age_group": "6-8 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_2": {
        "text": "**A Star Scientist Says Goodbye** Professor Eknath Chitnis was a very smart scientist. He helped India explore space. He was 100 years old. He passed away in a city called Pune. Professor Chitnis was one of the first people to help India's space program. He was very important in starting ISRO. ISRO is the Indian Space Research Organisation. A man named Vikram Sarabhai picked Professor Chitnis. Vikram Sarabhai was like the dad of India's space program. Professor Chitnis was his special helper. Professor Chitnis helped find places for rockets to launch. They looked for a good spot near the sea.",
        "word_count": 100,
        "sentence_count": 12,
        "complexity_level": "simple",
        "age_group": "9-11 years",
        "model_used": "gemini-2.5-flash-lite"
      },
      "group_3": {
        "text": "**A Star Scientist Says Goodbye** Professor Eknath Chitnis was a very smart scientist. He helped India explore space. He was 100 years old. He passed away in a city called Pune. Professor Chitnis was one of the first people to help India's space program. He was very important in starting ISRO. ISRO is the Indian Space Research Organisation. A man named Vikram Sarabhai picked Professor Chitnis. Vikram Sarabhai was like the dad of India's space program. Professor Chitnis was his special helper. Professor Chitnis helped find places for rockets to launch. They looked for a good spot near the sea. They found a place called Thumba. Later, they found another place called Sriharikota. Professor Chitnis was the boss of a special center. This center helped use space for learning. It was called the Space Application Centre. He led a big project called SITE. SITE used TV from space to teach...",
        "word_count": 150,
        "sentence_count": 19,
        "complexity_level": "moderate",
        "age_group": "12-14 years",
        "model_used": "gemini-2.5-flash-lite"
      }
    },
    "processed_at": "2025-10-22T17:08:33.073473"
  }
]