[
  {
    "source": "The Hindu",
    "title": "Four killed, 10 injured in fire at building in Navi Mumbai",
    "description": "After being alerted, 40 fire brigade personnel along with 8 fire tenders and police rushed to the spot and the blaze was put out by 4 a.m., the official said",
    "url": "https://www.thehindu.com/news/national/maharashtra/four-killed-10-injured-in-fire-at-building-in-navi-mumbai/article70185987.ece",
    "published_date": "2025-10-21T10:58:53",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Four persons were killed and 10 others suffered injuries after a fire broke out in a multi-storey residential building in Maharashtra's Navi Mumbai township shortly after midnight on Tuesday (October 21, 2025), police said. Prima facie, the blaze started at around 12.30 a.m. in a flat on the 10th floor of the Raheja Residency, MGM Complex, at Sector 14 in Vashi area, and spread to the 11th and 12th floors, an official said. Two women, a man and a 6-year-old girl were killed, while 10 others were injured, he said. The injured persons were rushed to two hospitals in Vashi. After being alerted, 40 fire brigade personnel along with 8 fire tenders and police rushed to the spot and the blaze was put out by 4 a.m., the official said. The cause of the fire was yet to be ascertained, the official said. Published- October 21, 2025 04:28 pm IST Maharashtra/fire",
    "extracted_at": "2025-10-21T16:52:09.529694"
  },
  {
    "source": "The Hindu",
    "title": "Efforts underway to neutralise foreign terrorists hiding in Jammu forests: IGP",
    "description": "Terrorists and criminals are using new technology like drones in an attempt to break the security grid, but the security agencies are two steps ahead of them to maintain the internal security, says IGP",
    "url": "https://www.thehindu.com/news/national/jammu-and-kashmir/efforts-underway-to-neutralise-foreign-terrorists-hiding-in-jammu-forests-igp/article70185756.ece",
    "published_date": "2025-10-21T10:52:43",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Asserting that more than 100 anti-terrorist operations are being carried out daily across the Jammu division, a top police officer on Tuesday (October 21, 2025) said the presence of foreign terrorists in the dense forests is a major challenge, and efforts are underway to neutralise them. Inspector General of Police, Jammu Zone, Bhim Sen Tuti said, the terrorists and criminals are using new technology like drones in an attempt to break the security grid but the security agencies are two steps ahead of them to maintain the internal security. Mr. Tuti was speaking to media persons after leading a wreath-laying ceremony at Police Martyrs Memorial near Jammu railway station and later at a function at Gulshan Ground in police headquarters to pay tributes to bravehearts who have sacrificed their lives for the country on the occasion of Police Commemoration Day. The day is observed in commemoration of 10 valiant martyrs of the CRPF who made the supreme sacrifice in the line of duty on October 21, 1959. They laid down their lives in an ambush laid by heavily armed Chinese troops at Hot Springs, Ladakh, at an altitude of 4,681 metres. “For the past two years, foreign terrorists have been a major challenge [in Jammu], but we are strengthening our counter-terrorism and border protection grid. I hope that soon we will be able to deal with the foreign terrorists hiding in forest areas and neutralise them,” the Jammu Police chief said. Mr. Tuti said around 120 counter-terrorist operations are launched in the Jammu zone every day. “This is our daily duty, whether it is a speculative operation or a precise information-based operation, it is ongoing,” he said, adding that fighting terrorism is an important part of their duties. “The number of people who have been martyred fighting terrorism in the Jammu zone is just one part of our duty. Apart from this, we also perform other duties. For example, we should not forget those comrades who have been martyred after being run over while pe",
    "extracted_at": "2025-10-21T16:52:10.352446"
  },
  {
    "source": "The Hindu",
    "title": "Bihar Assembly polls: Prashant Kishor alleges three candidates of his party withdrew under BJP’s ‘pressure’",
    "description": "The candidates who withdrew from the race were fielded in the Danapur, Brahampur, and Gopalganj seats, he said",
    "url": "https://www.thehindu.com/elections/bihar-assembly/bihar-assembly-polls-prashant-kishor-alleges-three-candidates-of-his-party-withdrew-under-bjps-pressure/article70185941.ece",
    "published_date": "2025-10-21T10:46:49",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Poll strategist-turned-politician Prashant Kishor on Tuesday (October 21, 2025) alleged that three candidates of his Jan Suraaj Party in the Bihar elections withdrew their nominations under \"pressure\" from the BJP. Addressing a press conference, Mr. Kishor alleged that the ruling NDA was so scared of losing the elections that it was threatening Opposition candidates to withdraw from the race. \"Democracy is being murdered. There has been no such precedent in the country,\" he alleged, urging the Election Commission to ensure the security of the candidates. Bihar Assembly election LIVE The candidates who withdrew from the race were fielded in the Danapur, Brahampur, and Gopalganj seats, he said. \"The BJP is trying to replicate the Surat model, in which their candidate got elected unopposed, as all other nominees were coerced to pull out. The BJP does not realise that voters had punished it across the country for it, and it won just 240 seats, though it had bragged that the tally would be 400-plus in last year's Lok Sabha polls,\" he added. Mr. Kishor's party had announced candidates for all 243 seats in Bihar. With the withdrawal of three candidates from the race, it will now fight on 240 seats as the last date for filing of nominations has already passed. Published- October 21, 2025 04:16 pm IST Bihar Assembly Elections 2025/Jan Suraaj Party/Bharatiya Janata Party/Bihar",
    "extracted_at": "2025-10-21T16:52:11.165811"
  },
  {
    "source": "The Hindu",
    "title": "Telangana receives 44 fire calls on Deepavali, no major incidents linked to crackers",
    "description": "",
    "url": "https://www.thehindu.com/news/national/telangana/telangana-receives-44-fire-calls-on-deepavali-no-major-incidents-linked-to-crackers/article70185667.ece",
    "published_date": "2025-10-21T10:43:23",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "The Telangana State Disaster Response and Fire Services Department received 44 fire calls across the State onDeepavali day,including 18 within the limits of the Greater Hyderabad Municipal Corporation (GHMC). Officials from the Fire Control Room said that of the total, 38 were categorised as small fires, three as medium, and one as serious. The medium fire calls were reported from Chandulal Baradari, Yakutpura, and Mahabubabad, while the serious call came from an industrial unit in Sangareddy. Preliminary findings suggest that the Sangareddy fire was caused by a short circuit and not linked to fireworks. “No major fire incidents related to crackers were reported this year,” an official from the fire control room confirmed. In comparison, the department had received 33 fire calls during Deepavali in 2024, all related to crackers, including three major mishaps. One such incident occurred on Street Number 18 in Himayat Nagar, where a third-floor flat was gutted. While property damage was significant, no serious injuries were reported in any of the incidents, officials added. Published- October 21, 2025 04:13 pm IST disaster, accident and emergency incident/fire/Telangana/Hyderabad/disaster",
    "extracted_at": "2025-10-21T16:52:12.036693"
  },
  {
    "source": "The Hindu",
    "title": "Three women booked for offering namaz inside Shaniwar wada in Pune after video goes viral",
    "description": "FIR has been filed under provisions of the Ancient Monuments and Archaeological Sites and Remains (AMASR) Rules, 1959, for allegedly violating restrictions applicable to protected monuments, says Pune City police",
    "url": "https://www.thehindu.com/news/national/maharashtra/three-women-booked-for-offering-namaz-inside-shaniwar-wada-in-pune-after-video-goes-viral/article70185549.ece",
    "published_date": "2025-10-21T10:34:01",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "A case has been registered against three unidentified women after a video showing them offering namaz on the premises of Pune's historic Shaniwar wada went viral on social media, sparking protests by BJP MP Medha Kulkarni and members of other organisations. According to the Pune City Police, the FIR has been filed under provisions of the Ancient Monuments and Archaeological Sites and Remains (AMASR) Rules, 1959, for allegedly violating restrictions applicable to protected monuments. The incident reportedly took place around 1.45 p.m. on Saturday (October 18, 2025), following which an Archaeological Survey of India (ASI) officer lodged a formal complaint to Pune City Police. The video led to protest demonstrations on Sunday (October 19, 2025) by BJP MP Medha Kulkarni and other members of a city-based right-wing outfit. They also performed purification rituals at spot where namaz was offered, police have increase security deployment around Shaniwar wada. \"We have invoked the relevant Section of the AMASR Rules, which provides for penalties related to prohibited activities within protected monuments,\" a police officer said. Meanwhile, Maharashtra Minister Nitesh Rane, commenting on a viral video allegedly showing women offering namaz at Shaniwar wada and the BJP performing \"purification\" there, stated that Shaniwar wada is a symbol of Hindu valour and close to the community's heart. He questioned if Muslims would accept Hindus chanting Hanuman Chalisa at Haji Ali, emphasising that prayers should be offered at designated places. Mr. Rane supported Hindu workers raising their voice on the issue. \"Shaniwar wada has a history. It is the symbol of our valour. It is very close to the Hindu community's heart. If you want to offer namaz there, will you be fine with Hindus going to Haji Ali and chanting Hanuman Chalisa? Will your sentiments not be hurt?. One should offer prayers only at the designated places. If Hindu workers raised their voice, then it is correct,\" Mr. Rane to",
    "extracted_at": "2025-10-21T16:52:12.842946"
  },
  {
    "source": "The Hindu",
    "title": "HMDA registers 245% rise in permit fee collection this year; skyscrapers lead growth",
    "description": "In a significant turnaround, HMDA has reported a surge in building permissions and revenue this year, driven largely by the booming multi-storeyed building sector. Total collections reach ₹1,225 crore",
    "url": "https://www.thehindu.com/news/national/telangana/hmda-registers-245-rise-in-permit-fee-collection-this-year-skyscrapers-lead-growth/article70185666.ece",
    "published_date": "2025-10-21T09:54:16",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "A 63-floor tower, housing 362 units on a 2.17 acre plot in Kokapet, is the tallest residential structure the Hyderabad Metropolitan Development Authority (HMDA) has sanctioned this year up to September [2025]. Added with a five-tower 56-floor complex on 7.71 acres, and another mixed use project with 66 lakh square feet built up area on 9.71 acres, Kokapet wears the crown as the most sought after real estate destination in the urban metropolis, as measured in terms of building permissions granted by HMDA. Two more buildings, with 30 and 47 floors respectively, are coming up in Bandlaguda Jagir, speaking for the unmitigated penchant for high rise dwellings. A statement from the HMDA has informed that themulti-storeyed building (MSB) segmentled the impressive growth in building permissions during the period. A total 77 applications have been sanctioned, covering 78.71 lakh square metres and earning ₹514 crore for the urban development authority — a sharp rise from 55 applications in 2023, accounting for 37.03 lakh sq m, and ₹215 crore revenue. The total revenue earned by HMDA too has shown a whopping rise, with permit fee collections surging to ₹1,225 crore, up by 245% from ₹355 crore in 2024 and by 82% from ₹674 crore in 2023. Monthly revenues have consistently exceeded those of previous years. In September alone, collections touched ₹132 crore, a 263% increase over September 2024. During the nine month period, HMDA disposed of 6,079 applications, marking a 49% increase over 2024 and 36% over 2023. Building permissions received totalled to 2,961, up 18% from 2024 and 8% from 2023, while 2,904 cases were cleared, reflecting a 47% rise over 2024 and 26% over 2023. Noting that the HMDA has recorded a “remarkable” turnaround in urban governance between January and September this year, Metropolitan Commissioner Sarfaraz Ahmad attributed the performance to a strengthened monitoring system. All pending files are now classified by duration — over 60 days, 30–60 days, within 3",
    "extracted_at": "2025-10-21T16:52:13.859968"
  },
  {
    "source": "The Hindu",
    "title": "Flash floods inundate houses, shop at Cherupuzha as heavy rains batter hilly areas of Kannur in Kerala",
    "description": "Local residents said water levels rose rapidly following hours of intense rainfall in upper catchment areas",
    "url": "https://www.thehindu.com/news/national/kerala/flash-floods-inundate-houses-shop-at-cherupuzha-as-heavy-rains-batter-hilly-areas-of-kannur-in-kerala/article70185809.ece",
    "published_date": "2025-10-21T09:53:45",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Continuous heavy rain in the hilly regions of Kannur, Kerala, triggered flash floods in Cherupuzha on Monday night, inundating two houses and a business establishment. At Prappoil, a compound wall collapsed onto a nearby house, though no casualties were reported. Local residents said water levels rose rapidly following hours of intense rainfall in the upper catchment areas. Heavy rain continues to lash several parts of Kerala. The Indian Meteorological Department (IMD) has issued an orange alert for Idukki, Ernakulam, Malappuram and Kozhikode districts on Tuesday, indicating the likelihood of very heavy rainfall. A yellow alert is in place for Thiruvanathapuram, Kollam, Pathanamthitta, Alapuzha, Kottayam, Thrissur, Palakkad, Wayanad, Kannur and Kasaragod districts. Authorities have urged residents in landslide-prone and low-lying areas to remain vigilant as the rain is expected to continue for the next few days. Published- October 21, 2025 03:23 pm IST natural disaster/disaster/disaster, accident and emergency incident/flood/weather/rains/Kerala",
    "extracted_at": "2025-10-21T16:52:14.653281"
  },
  {
    "source": "The Hindu",
    "title": "Youth caught breaking into women’s hostel in Kerala’s Kannur",
    "description": "The police suspect that the youth was under the influence of alcohol",
    "url": "https://www.thehindu.com/news/national/kerala/youth-arrested-for-breaking-into-womens-hostel-in-keralas-kannur/article70185745.ece",
    "published_date": "2025-10-21T09:27:31",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "A youth who broke into a women’s hostel at Thavakara, Kannur city, Kerala, was caught red-handed by the hostel staff and locals around 10 pm on Monday. According to the police, the accused, who lives within city limits, arrived in a four-wheeler, parked the vehicle near the hostel and climbed over the compound wall to enter the premises. Some inmates noticed the intruder and alerted the warden, following which the security staff rushed to the spot. Upon seeing them, the youth tried to flee, jumping off the wall, but was chased for about 100 meters and caught with the help of locals. He was later handed over to the Kannur town police. The police suspect that the youth was under the influence of alcohol at the time of the incident. An investigation is under way to determine whether he acted alone or had accomplices. Published- October 21, 2025 02:57 pm IST crime, law and justice/crime/law enforcement/assault/investigation (criminal)/arrest",
    "extracted_at": "2025-10-21T16:52:15.487927"
  },
  {
    "source": "The Hindu",
    "title": "K-Rail route likely to be revised, says CPI(M) Kerala secretary M.V. Govindan",
    "description": "Govindan says a new approach is necessary since the Centre has not yet approved the existing proposal",
    "url": "https://www.thehindu.com/news/national/kerala/k-rail-route-likely-to-be-revised-says-cpim-kerala-secretary-mv-govindan/article70185697.ece",
    "published_date": "2025-10-21T09:17:05",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "The Communist Party of India [CPI(M)] is considering changes to the K-Rail project, with plans to shift it to a new route, party Kerala State secretary M.V. Govindan has said. Speaking to the media at Taliparamba in Kannur on Tuesday, he clarified that a new approach was necessary since the Centre had not yet approved the existing proposal. Mr. Govindan said that financial constraints were not an issue and that the only hurdle was the lack of Central approval.  He described K-Rail as “one of Kerala’s most important development projects in the last 50 years.” His remarks come in support of the proposal submitted to the Railways last March by technocrat E. Sreedharan. Mr. Sreedharan had stated that the alternative plan was more practical than the original K-Rail alignment and would not affect local residents. “The alternative is more useful than K-Rail. There will be no problem for the locals, but the Central overnment must give permission,” he told the media in March. Published- October 21, 2025 02:47 pm IST products and services/economy, business and finance/railway transport/transport/politics and government/Kerala/Kannur/infrastructure projects/construction and property",
    "extracted_at": "2025-10-21T16:52:16.303868"
  },
  {
    "source": "The Hindu",
    "title": "Police Commemoration Day observed in Villupuram, Cuddalore, Kallakurichi",
    "description": "The Police Commemoration Day is observed on October 21 every year to pay respects to the 10 policemen who were killed by Chinese troops in an ambush at Hot Springs in Ladakh in 1959.",
    "url": "https://www.thehindu.com/news/national/tamil-nadu/police-commemoration-day-observed-in-villupuram-cuddalore-kallakurichi/article70185422.ece",
    "published_date": "2025-10-21T08:44:20",
    "category": "national",
    "extraction_method": "rss",
    "raw_content": "Deputy Inspector General of Police (Villupuram Range) E.S. Uma on Tuesday (October 20,2025) paid tributes to police personnel, who died while on duty, on the occasion of Police Commemoration Day at the Armed Reserve police grounds in Villupuram. After the commemoration parade, Ms. Uma placed wreaths at the Martyrs’ column in the police grounds. Superintendent of Police P. Saravanan was present. In Cuddalore district, Superintendent of Police S. Jeyakumar led the police in paying homage. The solemn occasion drew to a close with a 21 gun salute by Armed Reserve police personnel. Cuddalore Superintendent of Police S. Jeyakumar pays homage to police personnel who laid down their lives while on duty, on Police Commemoration Day, at the Armed Reserve grounds in Cuddalore on October 21, 2025\n                                                            | Photo Credit: \n                                Special Arrangement Kallakurichi Superintendent of Police G.S. Madhavan led the police in paying homage at the district police office in Kallakurichi. The Police Commemoration Day is observed on October 21 every year to pay respects to the 10 policemen who were killed by Chinese troops in an ambush at Hot Springs in Ladakh in 1959. As many as 66 personnel who lost their lives between September 1, 2024, and August 31 this year, were remembered across the country during the day. Published- October 21, 2025 02:14 pm IST police/law enforcement/crime, law and justice/human interest",
    "extracted_at": "2025-10-21T16:52:17.114051"
  },
  {
    "source": "Hindustan Times",
    "title": "Heart ailments, respiratory risks: Why experts are raising alarm over Delhi AQI",
    "description": "Delhi is grappling with hazardousair quality following Diwalicelebrations, with health experts warning of serious risks for children, the elderly, and those with respiratory conditions. The national c",
    "url": "https://www.hindustantimes.com/india-news/heart-ailments-respiratory-risks-why-experts-are-raising-alarm-over-poor-aqi-in-delhi-101761040698127.html",
    "published_date": "2025-10-21T16:52:20.518579",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "Delhi is grappling with hazardousair quality following Diwalicelebrations, with health experts warning of serious risks for children, the elderly, and those with respiratory conditions. The national capital is seeing a continuous spell of deteriorating air quality with latest AQI at 355, in ‘very poor’ category, the data of the Central Pollution Control Board showed. The recent Diwali celebrations, coupled with metereological conditions and stubble burning in neighbouring states have made conditions worse for the capital's air quality. A study shows pollution causes a 22–25% rise in heart attacks, asthma, and bronchitis, according to Dr. GC Khilnani, Chairman of PSRI Institute of Pulmonary, Critical Care & Sleep Medicine. Dr. Nikhil Modi, Respiratory Medicine Specialist at Apollo Hospitals, explained the seasonal spike: “As winter approaches, cooler air traps pollutants near the ground. People with allergies and lung problems face coughing, watery eyes, and breathing difficulties, which have already surged after Diwali.” He advised children and the elderly to stay indoors and wear masks. Dr. Dhiren Gupta, Paediatric Pulmonologist at Sir Ganga Ram Hospital, emphasized that children, pregnant women, and asthma patients are particularly vulnerable. “Even healthy individuals can develop lung changes leading to pollution-induced asthma. Vehicular pollution remains a major concern,” he said. Local runner Ashish Ranjan described breathing difficulties during his morning run, saying, “I cannot breathe properly.” Another resident stressed individual responsibility in reducing pollution, noting that adherence to green cracker guidelines could help control AQI levels.",
    "extracted_at": "2025-10-21T16:52:20.518579"
  },
  {
    "source": "Hindustan Times",
    "title": "Use of term 'physical relations' without evidence not sufficient to establish rape: Delhi HC",
    "description": "New Delhi, Mere use of the term \"physical relations\" without supporting evidence is insufficient to establish rape or aggravated penetrative sexual assault, the Delhi High Court has held. The court's ",
    "url": "https://www.hindustantimes.com/india-news/use-of-term-physical-relations-without-evidence-not-sufficient-to-establish-rape-delhi-hc-101761045361486.html",
    "published_date": "2025-10-21T16:52:22.019288",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "New Delhi, Mere use of the term \"physical relations\" without supporting evidence is insufficient to establish rape or aggravated penetrative sexual assault, the Delhi High Court has held. The court's observation came while allowing a man's appeal challenging his conviction and 10 years imprisonment in a rape case and acquitting him of the charges. \"In the peculiar facts and circumstances of this case, the use of the term 'physical relations', unaccompanied by any supporting evidence, would not be sufficient to hold that the prosecution has been able to prove the offence beyond reasonable doubt. \"The appellant's conviction under Section 376 IPC and Section 6 of the POCSO Act is unsustainable,\" Justice Manoj Kumar Ohri said in a judgment passed on October 17. The court, which termed it an unfortunate case, said it was bound to decide the matter on its own merits. It said the child victim and her parents repeatedly stated that \"physical relations\" were established however, there was no clarity as to what was meant by this expression. \"No further description of the alleged act has been given. Unfortunately, no questions have been put to the victim by the prosecution or trial court to gain some clarity as to whether the essential ingredients of the offence the appellant was charged with, have been made out or not,\" it said. The court was dealing with a case registered in 2023 in which the 16-year-old victim had alleged that her cousin established physical relations with her on the false pretext of marriage for more than a year in 2014. The man challenged his conviction and the high court allowed his appeal saying that the prosecution's case hinged only on the oral evidence being the testimony of the child victim and her parents and that there was no forensic evidence on record. The court said the expression \"physical relations\" was not used or defined either under the IPC or POCSO Act.",
    "extracted_at": "2025-10-21T16:52:22.019288"
  },
  {
    "source": "Hindustan Times",
    "title": "Ex Punjab DGP's son, found dead last week, had alleged father-wife affair",
    "description": "A sensational twist has emerged in the mysterious death of former Punjab DGP Mohammad Mustafa’s son, Aqil Akhtar, after a resurfaced video showed the 35-year-old alleging that his father had an affair",
    "url": "https://www.hindustantimes.com/india-news/ex-punjab-dgp-mohammad-mustafa-son-aqil-akhtar-found-dead-last-week-had-alleged-father-wife-affair-101761044464864.html",
    "published_date": "2025-10-21T16:52:23.398749",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "A sensational twist has emerged in the mysterious death of former Punjab DGP Mohammad Mustafa’s son, Aqil Akhtar, after a resurfaced video showed the 35-year-old alleging that his father had an affair with his wife - and that his mother and sister were conspiring to kill him. The Haryana Police on Tuesdaybooked Mustafa, a retired DGP (human rights), and his wife, former minister and three-time MLA Razia Sultana, for the alleged murder of their son in Panchkula on the night of October 16. According to police, Aqil was found unconscious at his Sector 4 home in the Mansa Devi Complex area and declared dead upon arrival at Civil Hospital in Sector 6. His family had claimed it was a case of drug overdose, and the body was released after post-mortem for cremation at their native Saharanpur village in Uttar Pradesh. However, the case took a dramatic turn when Shamshudeen Chaudhary, a resident of Malerkotla and acquaintance of the family, lodged a complaint citing Aqil’s August 27 video post. In the video, Aqil claimed his father and wife were having an affair, and that his family planned to either “get him killed” or “frame him in a false case.” “I have discovered my wife's affair with my dad. I am under immense mental trauma. My mother and sister are also part of the conspiracy,” Aqil had said in the video, adding that he feared for his life. Chaudhary, in his complaint, said the circumstances of Aqil’s sudden death appeared suspicious and matched his earlier apprehensions. He urged the Haryana DGP and Chief Minister Nayab Singh Saini to ensure an “impartial and transparent probe,” submitting screenshots of Aqil’s diary and his social media posts as supporting evidence. In another video recorded weeks before his death, Aqil claimed his family labelled him “mentally unstable” to discredit him and had confined him illegally at a rehabilitation centre. “This confinement was illegal… They threatened to frame me in a rape or murder case if I took any step against them,” he all",
    "extracted_at": "2025-10-21T16:52:23.398749"
  },
  {
    "source": "Hindustan Times",
    "title": "Prashant Kishor claims 3 party candidates 'forced' to withdraw Bihar nomination",
    "description": "Poll strategist-turned-politician Prashant Kishor on Tuesday levelled a big allegation against the ruling NDA in Bihar. Kishor said that three candidates of his Jan Suraaj Party had to withdraw their ",
    "url": "https://www.hindustantimes.com/india-news/prashant-kishor-jan-suraaj-candidates-forced-to-withdraw-bihar-nomination-pressure-intimidation-bjp-101761045103621.html",
    "published_date": "2025-10-21T16:52:24.763615",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "Poll strategist-turned-politician Prashant Kishor on Tuesday levelled a big allegation against the ruling NDA in Bihar. Kishor said that three candidates of his Jan Suraaj Party had to withdraw their nomination and accused the BJP of trying to \"create an atmosphere that we're scared\". The BJP is part of the ruling NDA coalition, apart from Chief Minister Nitish Kumar's Janata Dal (United). With just weeks left for the Assembly elections in Bihar, Prashant Kishor made the big claim during a press conference in Patna. \"The election process has begun, and if anyone is feeling the most threatened, it's the NDA's BJP... They're using the mahagathbandhan to scare the public, saying, 'Vote for us, or Lalu's jungle raj will return'... In the past four to five days, three declared Jan Suraaj candidates who filed their nominations were forced to withdraw their nominations,\" Kishor said. Taking a dig at the BJP, Prashant Kishor also said that the party \"has developed a reputation\" of forming the government in Bihar regardless of which party wins.",
    "extracted_at": "2025-10-21T16:52:24.763615"
  },
  {
    "source": "Hindustan Times",
    "title": "‘Aurangzeb, Akbar admirers…’: Delhi govt says pollution not linked to Diwali",
    "description": "The Delhi government on Tuesday dismissed claims that Diwali fireworks led to thecity’s pollution, accusing those making the link of being “admirers of Aurangzeb and Akbar” with vested interests. Lash",
    "url": "https://www.hindustantimes.com/india-news/aurangzeb-akbar-admirers-delhi-environment-minister-says-pollution-aqi-not-linked-to-diwali-slams-aap-101761042887699.html",
    "published_date": "2025-10-21T16:52:26.054863",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "The Delhi government on Tuesday dismissed claims that Diwali fireworks led to thecity’s pollution, accusing those making the link of being “admirers of Aurangzeb and Akbar” with vested interests. Lashing out at AAP for crticising the Delhi government's handling of pollution in the national capital, Delhi's environment minister Manjinder Singh Sirsa said that the party was deliberately bringing Diwali, Sanatana Dharma, and Hinduism into the picture. \"This isn't the BJP's festival. It's a Sanatan Hindu festival, and why are you cursing the festival? Why are you using words against the festival? But to say that BJP is celebrating Diwali, to say that BJP is bursting crackers like this, to say that BJP is doing such wrong things, I feel very embarrassed...,\" Sirsa said. He also accused former Delhi Chief Minister Arvind Kejriwal ofbanning firecrackers in the cityduring the AAP regime to \"garner the votes of a particular community\". \"Since this morning, Arvind Kejriwal's entire team has been constantly cursing Diwali... Sanjay Singh and his colleagues have been tweeting since last night, asking to stop celebrating Diwali. Aam Aadmi Party president is cursing the BJP,\" Sirsa said. He later lashed out at claims linkingDiwali celebrations to the rise in pollution levelsin the city and said: \"Those who are blaming Diwali for this, it is a lie. This is being done only to please some section. The admirers of Aurangzeb and Akbar are saying this; those who had put Tipu Sultan's photo in the Vidhan Sabha are saying this.\" The Environment Minister also noted that this year’s post-Diwali rise in pollution levels in Delhi was significantly lower compared to previous years. Presenting data during a press conference, Sirsa said that the difference between the Air Quality Index (AQI) recorded before and after Diwali was only 11 points, and asked: \"Will you hold Diwali responsible for this? Will you hold the faith of all the Sanatanis and Hindus in Delhi accountable? What is the fault in",
    "extracted_at": "2025-10-21T16:52:26.054863"
  },
  {
    "source": "Hindustan Times",
    "title": "RG Kar rape and murder accused Sanjay Roy's minor niece found dead: Report",
    "description": "More than a year after the RG Kar rape and murder case, the accused Sanjay Roy's niece was found dead inside a wardrobe at her home on Sunday in Alipore, South 24 Parganas district of West Bengal. The",
    "url": "https://www.hindustantimes.com/india-news/rg-kar-rape-and-murder-accused-sanjay-roys-minor-niece-found-dead-in-kolkata-residence-report-101761039865789.html",
    "published_date": "2025-10-21T16:52:27.331386",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "More than a year after the RG Kar rape and murder case, the accused Sanjay Roy's niece was found dead inside a wardrobe at her home on Sunday in Alipore, South 24 Parganas district of West Bengal. The girl’s body was reportedly found inside the wardrobe, News18 reported on Tuesday. The girl, who was a sixth-standard student, was immediately rushed to the nearby Seth Sukhlal Karnani Memorial (SSKM) Hospital, where she was declared brought dead. Her mother had also reportedly died by suicide a few years ago, after which her father remarried his sister-in-law, the report stated quoting sources at Kolkata Police headquarters in Lalbazar. On Sunday, her stepmother had left the house to buy crackers forDiwali. There was no one at home at the time of the incident. Neighbours told police that the victim's house often witnessed heated arguments. They further said that on the day of the incident, when the stepmother returned from the market, she received no response from the girl despite repeatedly calling out to her. When she broke into the house, the girl was nowhere to be found. Only when she opened the cupboard did she discover the girl's lifeless body. The police were informed immediately, the report stated. According to the News18 report, althoughKolkata Policesuspects it to be a case of suicide, the possibility of murder has not been ruled out. The family is yet to lodge a formal complaint. A case of unnatural death has been registered, and an investigation is underway while more details are awaited.",
    "extracted_at": "2025-10-21T16:52:27.331386"
  },
  {
    "source": "Hindustan Times",
    "title": "Bengal junior doctor attacked, threatened with sexual assault",
    "description": "A home guard volunteer and his associates allegedly attacked and threatened a junior doctor with sexual assault at the Sarat Chandra Chattopadhyay Government Medical College and Hospital in West Benga",
    "url": "https://www.hindustantimes.com/india-news/bengal-junior-doctor-attacked-threatened-with-sexual-assault-101761043426470.html",
    "published_date": "2025-10-21T16:52:28.690565",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "A home guard volunteer and his associates allegedly attacked and threatened a junior doctor with sexual assault at the Sarat Chandra Chattopadhyay Government Medical College and Hospital in West Bengal’s Howrah district on Monday evening. The main accused, Babulal, was arrested along with one of his associates. A police officer said the incident happened when around a dozen people went to the hospital’s maternity ward with a pregnant woman and demanded that the junior doctor on duty examine her. “According to the complainant, the home guard volunteer claimed to be a police officer. An investigation is on.” The complainant, a senior resident at the hospital’s gynaecology and obstetrics department, alleged that even the patient kicked her when she was being examined. The junior doctor said the patient was resisting an abdominal examination. “I did it nonetheless, but found nothing that needed immediate medical attention. When I started examining other patients, people accompanying the woman pressured me to examine her again,” she said. “I told them a senior doctor would soon be on duty and the patient would be examined. On hearing this, one of the men threatened that I would not reach home alive. He mentioned my private parts and said he would insert an iron rod inside me.” She said a second man twisted her arms. “The two men hit me on my shoulder. They tried to slap me, too. The incident happened between 5.30 and 5.45pm inside the ward in front of the nurses and medical attendants.” The junior doctor said there were around a dozen men, but not a single security personnel. “The hospital authorities have lodged a complaint. I am scared.” A government official said the health department’s principal secretary, N S Nigam, has sought a report from the hospital. The West Bengal Doctors Forum condemned the incident. “This is not an isolated crime. This is the symptom of total lawlessness that has gripped our health care system. Hospitals in West Bengal have turned into unsaf",
    "extracted_at": "2025-10-21T16:52:28.690565"
  },
  {
    "source": "Hindustan Times",
    "title": "‘When clouds will come…’: Why Delhi minister ruled out artificial rain in city",
    "description": "As Delhi faces 'very poor' air quality a day after Diwali, Delhi Environment Minister Manjinder Singh Sirsa shared an update on the Rekha Gupta-led BJP government's plan for artificial rain through cl",
    "url": "https://www.hindustantimes.com/india-news/when-the-clouds-will-come-why-delhi-minister-ruled-out-artificial-rain-amid-very-poor-aqi-101761041438544.html",
    "published_date": "2025-10-21T16:52:29.966411",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "As Delhi faces 'very poor' air quality a day after Diwali, Delhi Environment Minister Manjinder Singh Sirsa shared an update on the Rekha Gupta-led BJP government's plan for artificial rain through cloud seeding, a long-awaited proposal to mitigate the annual air pollution crisis during approaching winters. While addressing a briefing on Tuesday, Sirsa ruled out an immediate plan for cloud seeding, saying the seeding will only be possible \"when there are clouds\". Also Read:‘Delhi’s air in shambles, Supreme Court chose crackers over right to live’: Amitabh Kant \"For those asking us, why are we not getting cloud seeding done. I want to tell these illiterate people, they are burning in vengeance and forget everything. In cloud seeding, the cloud comes first and then comes the seeding,\" the minister said in the briefing. \"So, when the clouds will come, then there will be seeding. The day there are clouds, then there will be seeding done and there will be rain as well,\" he added. Delhi on Tuesday woke to a thick and toxic haze as the air pollution levels soared over 300, several times than number recommended by World Health Organization. Also Read:Delhi ready for cloud seeding, awaits IMD’s green signal: Sirsa However, the minister, while speaking of ‘very poor’ AQI, said that the air quality index in Delhi before Diwali was 341 and it rose to 356 after festival, just 11 points up. The remarks of the environment minister came even as 29 out of 31 stations in Delhi were in red, indicating ‘very poor’ AQI. The highest AQI was recorded in Bawana at 429 (severe), according to the government data available on SAMEER app. The pollution spiked in the national capital this week due to a host of reasons: bursting of Diwali crackers, poor meteorological conditions, stubble burning in parts of neighbouring states and vehicular emissions.",
    "extracted_at": "2025-10-21T16:52:29.966411"
  },
  {
    "source": "Hindustan Times",
    "title": "Rain lashes TN, red alert issued in 8 districts; CM reviews situation",
    "description": "Chennai, As the Northeast monsoon intensified across Tamil Nadu, the regional weather office on Tuesday issued heavy rainfall alert to a number of districts, while Chief Minister M K Stalin reviewed t",
    "url": "https://www.hindustantimes.com/india-news/rain-lashes-tn-red-alert-issued-in-8-districts-cm-reviews-situation-101761041776161.html",
    "published_date": "2025-10-21T16:52:31.307376",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "Chennai, As the Northeast monsoon intensified across Tamil Nadu, the regional weather office on Tuesday issued heavy rainfall alert to a number of districts, while Chief Minister M K Stalin reviewed the situation with officials and directed that precautionary measures be put in place in view of the downpour. A 'red' alert was issued for 8 districts and an orange alert for Chennai for Tuesday, even as widespread rains lashed various parts of the state, according to the Met department. Stalin reviewed precautionary measures being undertaken in the city and its surrounding districts and the Cauvery delta districts that have been witnessing steady downpour. A red alert was issued to Villupuram, Cuddalore, Mayiladuthurai, Nagapattinam, Tiruvallur, Thanjavur, Pudukottai and Ramanathapuram, an official from the Regional Meteorological Centre said. Similar alert was sounded for neighbouring Puducherry union territory as well. \"Heavy rain is likely in the entire north coastal belt, but extremely heavy rain is expected in the above districts,\" the official said. According to him, an orange alert has been sounded for Chennai, Tiruvallur, Chengalpattu, Kancheepuram, Kallakurichi, Ariyalur, Perambalur, Thoothukudi, Tirunelveli and Kanyakumari. A red alert indicates extremely heavy rain of over 20 cm in 24 hours, while an orange alert means very heavy rain of 11 cm to 20 cm. In Chennai, CM Stalin held a meeting with district collectors through video conference and instructed them to keep relief camps ready for people affected by rain. All arrangements should be made for people, including food, drinking water and medicine, he said, according to an official release. To mitigate damage caused by rain, the CM advised the teams to be ready with necessary equipment like JCB machines, boats, motor pumps, trucks and saws.",
    "extracted_at": "2025-10-21T16:52:31.307376"
  },
  {
    "source": "Hindustan Times",
    "title": "Continued unhygienic state of washrooms violation of fundamental rights of court users, SC told",
    "description": "New Delhi, The continued unhygienic state of washrooms in court complexes across the country constitutes a persistent violation of the fundamental rights and the right to dignity of all users, includi",
    "url": "https://www.hindustantimes.com/india-news/continued-unhygienic-state-of-washrooms-violation-of-fundamental-rights-of-court-users-sc-told-101761040616001.html",
    "published_date": "2025-10-21T16:52:32.622330",
    "category": "national",
    "extraction_method": "scraper",
    "raw_content": "New Delhi, The continued unhygienic state of washrooms in court complexes across the country constitutes a persistent violation of the fundamental rights and the right to dignity of all users, including judges, advocates, litigants and staff, according to a status report filed on behalf of different high courts before the Supreme Court. The apex court was informed that the poor condition of washrooms, even in the high courts in metropolitan cities, is not an isolated incident but shows a systemic and administrative failure in allocating funds, enforcing maintenance contracts and ensuring accountability. \"The existing infrastructure fails to meet the standards of a modern and inclusive public utility; it directly implicates the failure to ensure public health and sanitation. \"The absence of facilities for Persons with Disabilities in major high courts and district courts constitutes a violation of their right to equality and non-discrimination, mandated by the Rights of Persons with Disabilities Act; this lack includes non-compliant construction, absence of ramps, support bars, and appropriate turning for wheelchairs,\" the status report said. The top court was told that the failure of most courts to provide separate and gender neutral/inclusive washrooms for the third gender disregards the fundamental rights and dignity. \"The lack of functional crèche/childcare facilities negatively impacts the right to practice a profession for female advocates and staff who are mothers, creating a barrier to gender equality in the legal profession. \"The situation is most critical in the subordinate judiciary, reflecting a profound infrastructure inequity. There is a need for micro-level development. What is required is decentralised implementation, focusing on local needs assessment, specific budget allocation, and community-level oversight to ensure functional water supply, plumbing, and daily cleaning contracts for every single court complex,\" the status report said. The apex cou",
    "extracted_at": "2025-10-21T16:52:32.622330"
  },
  {
    "source": "Indian Express",
    "title": "Bihar Election 2025 Live Updates: ‘Congress, RJD failed to uphold coalition dharma,’ JMM says won’t contest Bihar polls",
    "description": "Bihar Assembly Election 2025 Live Updates: Jharkhand’s ruling party blamed the RJD and Congress of not including it in seat-sharing talks., Bihar Assembly Election 2025 Live Updates: Last week, Prashant Kishor's Jan Suraaj Party announced its second list of candidates, for 65 constituencies, taking the total number of declared nominees to 116 out of the state’s 243 seats.",
    "url": "https://indianexpress.com/article/india/bihar-assembly-election-2025-live-updates-prashant-kishor-alleges-3-candidates-of-his-jan-suraaj-party-withdrew-nomination-under-pressure-from-bjp-10318419/",
    "published_date": "2025-10-21T16:24:40+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Bihar Assembly Election 2025 Live Updates: Prashant Kishor alleges 3 candidates of his Jan Suraaj Party withdrew nomination under ‘pressure’ from BJP Bihar Assembly Election 2025 Live Updates: Last week, Prashant Kishor's Jan Suraaj Party announced its second list of candidates, for 65 constituencies, taking the total number of declared nominees to 116 out of the state’s 243 seats. _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit By: [Express Web Desk](https://indianexpress.com/agency/express-web-desk/) Updated: October 21, 2025 04:24 PM IST **Bihar Assembly Election 2025 Live Updates:** Addressing a press conference on Tuesday, Prashant Kishor alleged that three candidates of his Jan Suraaj Party in Bihar polls withdrew nomination under ‘pressure’ from the ruling coalition’s Bharatiya Janata Party (BJP). Kishor urged Election Commission to ensure security of candidates in the poll-bound state. Last week his party announced its second list of candidates, for 65 constituencies, taking the total number of declared nominees to 116 out of the state’s 243 seats. The [Jharkhand Mukti Morcha](https://indianexpress.com/about/jharkhand-mukti-morcha/) (JMM) has announced that the party will not contest the upcoming Assembly elections in Bihar, accusing INDIA bloc allies Congress and RJD of failing to uphold coalition “dharma”. JMM leader Sudeep Kumar Sonu made the announcement at a press conference in Jharkhand’s Giridih. This comes just two days after JMM general secretary Supriyo Bhattacharya said on Saturday that the party would contest si",
    "extracted_at": "2025-10-21T16:52:38.297807"
  },
  {
    "source": "Indian Express",
    "title": "‘Truth is not what they showed’: Akhilesh Yadav, AAP target BJP after Ayodhya Deepotsav record | India News - The Indian Express",
    "description": "Two new world records were set at this year's Deepotsav in Ayodhya: one, for the largest display of oil lamps, and second, for most number of people performing 'aarti' simultaneously, Two new world records were set at this year's Deepotsav in Ayodhya: one, for the largest display of oil lamps, and second, for most number of people performing 'aarti' simultaneously",
    "url": "https://indianexpress.com/article/india/truth-is-not-what-they-showed-akhilesh-yadav-aap-target-bjp-after-ayodhya-deepotsav-record-10318649/",
    "published_date": "2025-10-21T14:27:35+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement ‘Truth is not what they showed’: Akhilesh Yadav, AAP target BJP after Ayodhya Deepotsav record Two new world records were set at this year's Deepotsav in Ayodhya: one, for the largest display of oil lamps, and second, for most number of people performing 'aarti' simultaneously By: [Express Web Desk](https://indianexpress.com/agency/express-web-desk/) New Delhi \\| October 21, 2025 02:27 PM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit Samajwadi Party (SP) leader Akhilesh Yadav, and the Aam Aadmi Party Tuesday came down heavily on the Bharatiya Janata Party-led government in Uttar Pradesh over the “reality of inflation and poverty” that has gripped the state. Posting a video of people collecting leftover oil in earthen lamps ( _diyas_) along the ghats of Ayodhya after Deepotsav, Yadav wrote in Hindi: “The truth is, these are the scenes… not the sights that people showed and then left.” It is unclear who shot the video and when. > सच तो ये दृश्य हैं… वो नज़ारा नहीं जिन्हें दिखाकर लोग चले गये। > > रोशनी के बाद का ये अंधेरा अच्छा नहीं। [pic.twitter.com/k35h4rHczu](https://t.co/k35h4rHczu) > > — [Akhilesh Yadav](https://indianexpress.com/about/akhilesh-yadav/) (@yadavakhilesh) [October 20, 2025](https://twitter.com/yadavakhilesh/status/1980299577124348050?ref_src=twsrc%5Etfw) Meanwhile, the [Aam Aadmi Party](https://indianexpress.com/about/aam-aadmi-party/) (AAP) shared the video from its official handle on X, slamming the [BJP](https://indianexpress.com/about/bjp/) for its “claims about reducing [inflation](https://indianexpress.c",
    "extracted_at": "2025-10-21T16:52:46.513140"
  },
  {
    "source": "Indian Express",
    "title": "News Today Live Updates, 21 October | Trishul Joint Exercise: Southern Command conducts network-centric Agni Drishti, spectrum dominance drill Trinetra",
    "description": "Latest News Live Updates | Agni Drishti is aimed at integrating land, air, space, and unmanned Intelligence, Surveillance, and Reconnaissance (ISR) assets, while Trinetra focuses on electromagnetic spectrum operations and counter-unmanned aerial system kill-chains., Latest News Live Updates | Agni Drishti is aimed at integrating land, air, space, and unmanned Intelligence, Surveillance, and Reconnaissance (ISR) assets, while Trinetra focuses on electromagnetic spectrum operations and counter-unmanned aerial system kill-chains.",
    "url": "https://indianexpress.com/article/india/latest-news-today-live-updates-world-india-cities-news-delhi-mumbai-bengaluru-10-21-2025-news-headlines-10318153/",
    "published_date": "2025-10-21T15:40:28+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement News Today Live Updates, 21 October \\| Trishul Joint Exercise: Southern Command conducts network-centric Agni Drishti, spectrum dominance drill Trinetra Latest News Live Updates \\| Agni Drishti is aimed at integrating land, air, space, and unmanned Intelligence, Surveillance, and Reconnaissance (ISR) assets, while Trinetra focuses on electromagnetic spectrum operations and counter-unmanned aerial system kill-chains. _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit By: [Express Web Desk](https://indianexpress.com/agency/express-web-desk/) Updated: October 21, 2025 03:40 PM IST The banned Communist Party of India (Maoist) has found a new public voice after its ideological head Mallojula Venugopal Rao alias Sonu surrendered along with 60 cadres in Maharashtra earlier this month. According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay. Pollution levels in [Delhi](https://indianexpress.com/section/cities/delhi/) spiked sharply through Diwali night on Monday, with the Delhi Pollution Control Committee (DPCC) real-time data showing PM2.5 and PM10 concentrations breaching safe limits by 15 to 18 times across several stations. Story continues below this ad The [Jharkhand Mukti Morcha](https://indianexpress.com/about/jharkhand-mukti-morcha/) (JMM) has announced that the party will not contest the upcoming Assembly elections in Bihar, accusing INDIA bloc allies Congress and RJD of failing to uphold coalit",
    "extracted_at": "2025-10-21T16:52:55.137013"
  },
  {
    "source": "Indian Express",
    "title": "Muhurat Trading Time For Diwali 2025: Stock Market, NSE, BSE Muhurat Trading 2025 date and time Latest News Updates",
    "description": "Stock Market, NSE, BSE Muhurat Trading 2025 Time for Diwali 2025: For 2025, muhurat trade will take place on Tuesday, October 21, and for the first time in years, the session will shift from nighttime to afternoon., Muhurat Trading Time for Diwali 2025: For 2025, muhurat trade will take place on Tuesday, October 21, and for the first time in years, the session will shift from nighttime to afternoon.",
    "url": "https://indianexpress.com/article/india/diwali-muhurat-trading-today-check-time-session-details-nse-bse-10318570/",
    "published_date": "2025-10-21T13:09:14+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Diwali Muhurat Trading today: Check time and session details for National Stock Exchange and Bombay Stock Exchange Muhurat Trading Time for Diwali 2025: For 2025, muhurat trade will take place on Tuesday, October 21, and for the first time in years, the session will shift from nighttime to afternoon. By: [Express Web Desk](https://indianexpress.com/agency/express-web-desk/) Bombay Stock Exchange, National Stock Exchange \\| October 21, 2025 01:09 PM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit **NSE, BSE Muhurat Trading Time 2025:** The investors are all set for Diwali Muhurat trading, which is held annually and is deemed a special trading period for new investments. On this day, the Indian Stock Exchanges—Bombay Stock Exchange (BSE) and National Stock Exchange (NSE)—open for an hour, allowing investors to execute symbolic trades that signal the start of the new fiscal year according to the Hindu lunar calendar, Samvat. The term ‘muhurat’ refers to an auspicious time in the Hindu calendar, a window believed to bring prosperity and good fortune, and trades placed during muhurat trading are really executed and settled under normal market rules. Story continues below this ad For decades before that, business families in Gujarat, Rajasthan, and Maharashtra celebrated Diwali as the beginning of a new fiscal year; however, when modern-day stock exchanges took over from traditional trading floors, the practice was modified rather than abandoned. Later, the NSE embraced the practice, ensuring that the ceremony endured even in a world",
    "extracted_at": "2025-10-21T16:53:04.311132"
  },
  {
    "source": "Indian Express",
    "title": "Techie falls into Ganga from under-construction Bajrang bridge in Rishikesh, rescue ops enter day 5 | India News - The Indian Express",
    "description": "The 31-year-old, who works in Delhi and hails from Madhya Pradesh, was there with two friends. MP CM asks Uttarakhand counterpart to expedite operations\n, The 31-year-old, who works in Delhi and hails from Madhya Pradesh, was there with two friends. MP CM asks Uttarakhand counterpart to expedite operations\n",
    "url": "https://indianexpress.com/article/india/techie-ganga-from-construction-bajrang-bridge-rishikesh-rescue-ops-10318517/",
    "published_date": "2025-10-21T12:39:15+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Techie falls into Ganga from under-construction Bajrang bridge in Rishikesh, rescue ops enter day 5 The 31-year-old, who works in Delhi and hails from Madhya Pradesh, was there with two friends. MP CM asks Uttarakhand counterpart to expedite operations Written by [Aiswarya Raj](https://indianexpress.com/profile/author/aiswarya-raj/) Dehradun \\| Updated: October 21, 2025 12:39 PM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit Five days after he went missing after falling into the Ganga, the search for a 31-year-old Madhya Pradesh man continued, with Chief Minister Mohan Yadav exhorting his counterpart iUttarakhand, Pushkar Singh Dhami, to expedite operations. On October 16, around 10:10 pm, Hemant Soni, who hails from Madhya Pradesh and works in [Delhi](https://indianexpress.com/section/cities/delhi/), and his two friends, Akshat Seth and Amit Soni, were at the Bajrang Setu or Bajrang bridge, an under-construction structure running parallel to the Laxman Jhula in Rishikesh. The three friends work in the IT industry in different companies in Delhi and were visiting Rishikesh for the first time. “He was standing atop a raised structure with glass shards and accidentally fell into the river. The friends informed us, and at 10.19 pm, we reached the spot. The operation is challenging as the temperature of water has been dipping,” said an officer from the Laxman Jhula police station working at the spot. Story continues below this ad The Pauri police and SDRF continue to search for the person and an FIR has been registered based on a ",
    "extracted_at": "2025-10-21T16:53:14.047453"
  },
  {
    "source": "Indian Express",
    "title": "Purnea MP Pappu Yadav bats for Congress again, says BJP and Chirag Paswan plotting to oust Nitish Kumar | India News - The Indian Express",
    "description": "Bihar assembly election 2025: Pappu Yadav on Monday had said that people from backward classes, Dalit communities and minorities are leaning towards the ideology of Congress leader and Lok Sabha Leader of Opposition Rahul Gandhi., Bihar assembly election 2025: Pappu Yadav on Monday had said that people from backward classes, Dalit communities and minorities are leaning towards the ideology of Congress leader and Lok Sabha Leader of Opposition Rahul Gandhi.",
    "url": "https://indianexpress.com/article/india/pappu-yadav-says-nitish-kumar-ousted-from-nda-10318480/",
    "published_date": "2025-10-21T12:26:51+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Purnea MP Pappu Yadav bats for Congress again, says BJP and Chirag Paswan plotting to oust Nitish Kumar Bihar assembly election 2025: Pappu Yadav on Monday had said that people from backward classes, Dalit communities and minorities are leaning towards the ideology of Congress leader and Lok Sabha Leader of Opposition Rahul Gandhi. By: [Express Web Desk](https://indianexpress.com/agency/express-web-desk/) October 21, 2025 12:26 PM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit Patna: With less than two weeks left for the Bihar Assembly elections, independent MP from Purnea Pappu Yadav has come forth backing the Congress again. He said the BJP and LJP (Ram Vilas)  are looking to sideline Bihar Chief Minister Nitish Kumar and that he would get the respect he deserves only from the Congress. He said, “The way [BJP](https://indianexpress.com/about/bjp/) and [Chirag Paswan](https://indianexpress.com/about/chirag-paswan/) have isolated [Nitish Kumar](https://indianexpress.com/about/nitish-kumar/) to maintain their strike rate, I don’t think Nitish Kumar will remain in the NDA after the elections. Only Congress will give Nitish Kumar the respect he deserves.” > VIDEO \\| Patna: Purnia MP [Pappu Yadav](https://indianexpress.com/elections/pappu-yadav-profile-6754272/) says, \"The way BJP and Chirag Paswan have isolated Nitish Kumar to maintain their strike rate, I don't think Nitish Kumar will remain in the NDA after the elections. Only Congress will give Nitish Kumar the respect he deserves.\"… [pic.twitter.com/VNTuNrdquv](https://t.co/V",
    "extracted_at": "2025-10-21T16:53:23.424044"
  },
  {
    "source": "Indian Express",
    "title": "Exclusive: Spate of surrenders later, Maoists get new public liaison who vouches for ‘armed struggle’",
    "description": "Commemorate communist Maoist shift: Sonu surrendered; Thippiri Tirupathi 'Devji' now acts as public face 'Abhay', issuing press releases, calling nationwide bandh, accusing surrenderers, and urging continued armed struggle., According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay",
    "url": "https://indianexpress.com/article/india/exclusive-surrenders-maoists-new-public-liaison-vouches-armed-struggle-10318434/",
    "published_date": "2025-10-21T11:53:50+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Exclusive: Spate of surrenders later, Maoists get new public liaison who vouches for ‘armed struggle’ According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay Written by [Nikhila Henry](https://indianexpress.com/profile/author/nikhila-henry/) New Delhi \\| October 21, 2025 11:53 AM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit The banned Communist Party of India (Maoist) has found a new public voice after its ideological head Mallojula Venugopal Rao alias Sonu surrendered along with 60 cadres in Maharashtra earlier this month. According to Telangana intelligence sources, Thippiri Tirupathi alias Devuji, believed to be the current General Secretary of the party, has doubled up as its public face under the pseudonym Abhay. Two press releases – one renouncing Sonu and other prominent leaders of the party who surrendered, and another calling a country-wide bandh on October 24 – have come out so far under the name Abhay. The letters were issued on October 16 and came to light three days later. “The name Abhay was once commonly used by Sonu to write press releases. Now, the name Abhay is being used by Tirupathi,” an intelligence source said, adding, “Devuji is hitting out at those who surrendered and gave up arms.” Devuji alias Devji hails from Telangana. Story continues below this ad The releases, which brand Sonu and others “petty-bourgeois”, “right-wing”, “defectors” and “traitors”, also stat",
    "extracted_at": "2025-10-21T16:53:32.654777"
  },
  {
    "source": "Indian Express",
    "title": "In letter to citizens, PM Modi says Bharat a ‘symbol of stability’ in a world with ‘multiple crises’ | India News - The Indian Express",
    "description": "He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated., He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated.",
    "url": "https://indianexpress.com/article/india/narendra-modi-bharat-symbol-of-stability-a-world-with-multiple-crises-10318380/",
    "published_date": "2025-10-21T13:46:51+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement In letter to citizens, PM Modi says Bharat a ‘symbol of stability’ in a world with ‘multiple crises’ He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated. By: [Express Web Desk](https://indianexpress.com/agency/express-web-desk/) New Delhi \\| Updated: October 21, 2025 01:46 PM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit Prime Minister Narendra Modi Tuesday said India has emerged as a symbol of both stability and sensitivity in a world that is going through multiple crises. In a letter to his fellow citizens, Modi said during Operation Sindoor, India not only upheld righteousness but also avenged injustice. “Lord Ram teaches righteousness, gives courage to fight injustice,” he added. He also mentioned that the Deepavali this year is special because for the first time, lamps would be lit in many districts where Naxalism has been eradicated. Story continues below this ad “We are also on track to become world’s third-largest economy in near future,” PM Modi said. He urged citizens to adopt swadeshi, respect all languages, prioritise health, reduce oil in food by 10 per cent and embrace yoga. From the homepage Expand **Stay updated with the latest - [Click here to follow us on Instagram](https://www.instagram.com/indianexpress/)** © IE Online Media Services Pvt Ltd This article went live on October twenty-first, twenty twenty-five, at twelve minutes past eleven in the morning. - Tags: - [Narendra Modi](https://indianexpress.c",
    "extracted_at": "2025-10-21T16:53:40.997739"
  },
  {
    "source": "Indian Express",
    "title": "Top 8 Metro cities AQI today: Post-Diwali air quality drops in four Metro cities",
    "description": "Major metropolitan cities in India faced a sharp decline in air quality post-Diwali, with Delhi recording a 'severe' AQI of 447. Residents are advised to stay indoors and wear masks amid worsening smog conditions., Majority metropolitan cities in India showed a significant decline in air quality as parts of the country woke up to smog a day after Diwali was celebrated. Among all metro cities, Delhi recorded the highest air quality index (AQI), falling in the ‘severe’ category as the national capital engulfed in smog on Tuesday morning. According […]",
    "url": "https://indianexpress.com/article/india/metro-cities-aqi-today-diwali-delhi-severe-aqi-bengaluru-air-quality-10318155/",
    "published_date": "2025-10-21T08:11:35+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement Post-Diwali AQI shoots up in four Metro cities, Bengaluru records ‘good’ air quality Majority metropolitan cities in India showed a significant decline in air quality as parts of the country woke up to smog a day after Diwali was celebrated. Among all metro cities, Delhi recorded the highest air quality index (AQI), falling in the ‘severe’ category as the national capital engulfed in smog on Tuesday morning. According \\[…\\] By: [Express Web Desk](https://indianexpress.com/agency/express-web-desk/) New Delhi \\| October 21, 2025 08:11 AM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit Majority metropolitan cities in India showed a significant decline in air quality as parts of the country woke up to smog a day after Diwali was celebrated. Among all metro cities, Delhi recorded the highest air quality index (AQI), falling in the ‘severe’ category as the national capital engulfed in smog on Tuesday morning. According to the readings by aqi.in, [Delhi](https://indianexpress.com/section/cities/delhi/) recorded an AQI of 447 at 7.30 am on Tuesday morning, falling in the ‘severe’ category. Of the eight total metropolitan cities, the AQI stands above 150 in five cities. Meanwhile, [Bengaluru](https://indianexpress.com/section/cities/bangalore/), [Hyderabad](https://indianexpress.com/section/cities/hyderabad/) and [Chennai](https://indianexpress.com/section/cities/chennai/) recorded an AQI less than 100 on Tuesday morning. After Delhi, the worst AQI was recorded in [Ahmedabad](https://indianexpress.com/section/cities/ahmedabad/) and [Kol",
    "extracted_at": "2025-10-21T16:53:50.401273"
  },
  {
    "source": "Indian Express",
    "title": "‘Police opened fire to secure doctors, nurses’: Drama at Telangana hospital after man accused of killing constable is shot dead | India News - The Indian Express",
    "description": "‘The police opened fire to secure the staff, including doctors and nurses, at the hospital,’ the DGP said in a statement, ‘The police opened fire to secure the staff, including doctors and nurses, at the hospital,’ the DGP said in a statement",
    "url": "https://indianexpress.com/article/india/police-opened-fire-to-secure-doctors-nurses-drama-at-telangana-hospital-after-man-accused-of-killing-constable-is-shot-dead-10317982/",
    "published_date": "2025-10-21T07:45:43+05:30",
    "category": "national",
    "extraction_method": "firecrawl",
    "raw_content": "Advertisement ‘Police opened fire to secure doctors, nurses’: Drama at Telangana hospital after man accused of killing constable is shot dead ‘The police opened fire to secure the staff, including doctors and nurses, at the hospital,’ the DGP said in a statement Written by [Nikhila Henry](https://indianexpress.com/profile/author/nikhila-henry/) Hyderabad \\| October 21, 2025 07:45 AM IST _![whatsapp](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-wapp-share.svg)_ Whatsapp _![twitter](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/twitter-preferred.svg)_ twitter _![facebook](https://indianexpress.com/wp-content/themes/indianexpress/images/opinion/images/icon-fb-share.svg)_ Facebook _![Reddit](https://indianexpress.com/wp-content/themes/indianexpress/images/black-icon-reddit.svg)_ Reddit A man accused of stabbing a police constable to death, who was taken into custody by police and admitted to a hospital in Telangana’s Nizamabad, was shot dead inside the hospital on Monday by police personnel after he allegedly tried to snatch a gun from them. Sheik Riyaz was accused of killing 42-year-old police constable E Pramod on Saturday. According to Nizamabad police, Riyaz was admitted in a hospital because he had sustained minor injuries in “a clash” with a “civilian who had helped the police to nab him” on Sunday. The civilian, Asif, was also stabbed by Riyaz, police said. At the Government General Hospital (GGH), Nizamabad, on Monday morning, Riyaz allegedly attempted to snatch a constable’s gun, “forcing police to open fire”, police said. Story continues below this ad “The police opened fire to secure the staff, including doctors and nurses, at the hospital,” a press release from Telangana Director General of Police Shivadhar Reddy’s office read. The DGP’s statement said the accused, “who had already murdered a constable and injured others, had managed to get hold of a gun at the hospital”. There could h",
    "extracted_at": "2025-10-21T16:53:59.702265"
  }
]